MikroElektronika/core_packages/PIC/XC8/def/PIC18F55Q43/mcu.h
// Register: CLCnGLS3
#define CLCnGLS3 CLCnGLS3
extern volatile unsigned char           CLCnGLS3            __at(0x0DF);
#ifndef _LIB_BUILD
asm("CLCnGLS3 equ 0DFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned G4D1N                  :1;
        unsigned G4D1T                  :1;
        unsigned G4D2N                  :1;
        unsigned G4D2T                  :1;
        unsigned G4D3N                  :1;
        unsigned G4D3T                  :1;
        unsigned G4D4N                  :1;
        unsigned G4D4T                  :1;
    };
} CLCnGLS3bits_t;
extern volatile CLCnGLS3bits_t CLCnGLS3bits __at(0x0DF);
// bitfield macros
#define _CLCnGLS3_G4D1N_POSN                                0x0
#define _CLCnGLS3_G4D1N_POSITION                            0x0
#define _CLCnGLS3_G4D1N_SIZE                                0x1
#define _CLCnGLS3_G4D1N_LENGTH                              0x1
#define _CLCnGLS3_G4D1N_MASK                                0x1
#define _CLCnGLS3_G4D1T_POSN                                0x1
#define _CLCnGLS3_G4D1T_POSITION                            0x1
#define _CLCnGLS3_G4D1T_SIZE                                0x1
#define _CLCnGLS3_G4D1T_LENGTH                              0x1
#define _CLCnGLS3_G4D1T_MASK                                0x2
#define _CLCnGLS3_G4D2N_POSN                                0x2
#define _CLCnGLS3_G4D2N_POSITION                            0x2
#define _CLCnGLS3_G4D2N_SIZE                                0x1
#define _CLCnGLS3_G4D2N_LENGTH                              0x1
#define _CLCnGLS3_G4D2N_MASK                                0x4
#define _CLCnGLS3_G4D2T_POSN                                0x3
#define _CLCnGLS3_G4D2T_POSITION                            0x3
#define _CLCnGLS3_G4D2T_SIZE                                0x1
#define _CLCnGLS3_G4D2T_LENGTH                              0x1
#define _CLCnGLS3_G4D2T_MASK                                0x8
#define _CLCnGLS3_G4D3N_POSN                                0x4
#define _CLCnGLS3_G4D3N_POSITION                            0x4
#define _CLCnGLS3_G4D3N_SIZE                                0x1
#define _CLCnGLS3_G4D3N_LENGTH                              0x1
#define _CLCnGLS3_G4D3N_MASK                                0x10
#define _CLCnGLS3_G4D3T_POSN                                0x5
#define _CLCnGLS3_G4D3T_POSITION                            0x5
#define _CLCnGLS3_G4D3T_SIZE                                0x1
#define _CLCnGLS3_G4D3T_LENGTH                              0x1
#define _CLCnGLS3_G4D3T_MASK                                0x20
#define _CLCnGLS3_G4D4N_POSN                                0x6
#define _CLCnGLS3_G4D4N_POSITION                            0x6
#define _CLCnGLS3_G4D4N_SIZE                                0x1
#define _CLCnGLS3_G4D4N_LENGTH                              0x1
#define _CLCnGLS3_G4D4N_MASK                                0x40
#define _CLCnGLS3_G4D4T_POSN                                0x7
#define _CLCnGLS3_G4D4T_POSITION                            0x7
#define _CLCnGLS3_G4D4T_SIZE                                0x1
#define _CLCnGLS3_G4D4T_LENGTH                              0x1
#define _CLCnGLS3_G4D4T_MASK                                0x80

// Register: DMASELECT
#define DMASELECT DMASELECT
extern volatile unsigned char           DMASELECT           __at(0x0E8);
#ifndef _LIB_BUILD
asm("DMASELECT equ 0E8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SLCT                   :8;
    };
    struct {
        unsigned SLCT0                  :1;
        unsigned SLCT1                  :1;
        unsigned SLCT2                  :1;
    };
} DMASELECTbits_t;
extern volatile DMASELECTbits_t DMASELECTbits __at(0x0E8);
// bitfield macros
#define _DMASELECT_SLCT_POSN                                0x0
#define _DMASELECT_SLCT_POSITION                            0x0
#define _DMASELECT_SLCT_SIZE                                0x8
#define _DMASELECT_SLCT_LENGTH                              0x8
#define _DMASELECT_SLCT_MASK                                0xFF
#define _DMASELECT_SLCT0_POSN                               0x0
#define _DMASELECT_SLCT0_POSITION                           0x0
#define _DMASELECT_SLCT0_SIZE                               0x1
#define _DMASELECT_SLCT0_LENGTH                             0x1
#define _DMASELECT_SLCT0_MASK                               0x1
#define _DMASELECT_SLCT1_POSN                               0x1
#define _DMASELECT_SLCT1_POSITION                           0x1
#define _DMASELECT_SLCT1_SIZE                               0x1
#define _DMASELECT_SLCT1_LENGTH                             0x1
#define _DMASELECT_SLCT1_MASK                               0x2
#define _DMASELECT_SLCT2_POSN                               0x2
#define _DMASELECT_SLCT2_POSITION                           0x2
#define _DMASELECT_SLCT2_SIZE                               0x1
#define _DMASELECT_SLCT2_LENGTH                             0x1
#define _DMASELECT_SLCT2_MASK                               0x4

// Register: DMAnBUF
#define DMAnBUF DMAnBUF
extern volatile unsigned char           DMAnBUF             __at(0x0E9);
#ifndef _LIB_BUILD
asm("DMAnBUF equ 0E9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BUF                    :8;
    };
    struct {
        unsigned BUF0                   :1;
        unsigned BUF1                   :1;
        unsigned BUF2                   :1;
        unsigned BUF3                   :1;
        unsigned BUF4                   :1;
        unsigned BUF5                   :1;
        unsigned BUF6                   :1;
        unsigned BUF7                   :1;
    };
} DMAnBUFbits_t;
extern volatile DMAnBUFbits_t DMAnBUFbits __at(0x0E9);
// bitfield macros
#define _DMAnBUF_BUF_POSN                                   0x0
#define _DMAnBUF_BUF_POSITION                               0x0
#define _DMAnBUF_BUF_SIZE                                   0x8
#define _DMAnBUF_BUF_LENGTH                                 0x8
#define _DMAnBUF_BUF_MASK                                   0xFF
#define _DMAnBUF_BUF0_POSN                                  0x0
#define _DMAnBUF_BUF0_POSITION                              0x0
#define _DMAnBUF_BUF0_SIZE                                  0x1
#define _DMAnBUF_BUF0_LENGTH                                0x1
#define _DMAnBUF_BUF0_MASK                                  0x1
#define _DMAnBUF_BUF1_POSN                                  0x1
#define _DMAnBUF_BUF1_POSITION                              0x1
#define _DMAnBUF_BUF1_SIZE                                  0x1
#define _DMAnBUF_BUF1_LENGTH                                0x1
#define _DMAnBUF_BUF1_MASK                                  0x2
#define _DMAnBUF_BUF2_POSN                                  0x2
#define _DMAnBUF_BUF2_POSITION                              0x2
#define _DMAnBUF_BUF2_SIZE                                  0x1
#define _DMAnBUF_BUF2_LENGTH                                0x1
#define _DMAnBUF_BUF2_MASK                                  0x4
#define _DMAnBUF_BUF3_POSN                                  0x3
#define _DMAnBUF_BUF3_POSITION                              0x3
#define _DMAnBUF_BUF3_SIZE                                  0x1
#define _DMAnBUF_BUF3_LENGTH                                0x1
#define _DMAnBUF_BUF3_MASK                                  0x8
#define _DMAnBUF_BUF4_POSN                                  0x4
#define _DMAnBUF_BUF4_POSITION                              0x4
#define _DMAnBUF_BUF4_SIZE                                  0x1
#define _DMAnBUF_BUF4_LENGTH                                0x1
#define _DMAnBUF_BUF4_MASK                                  0x10
#define _DMAnBUF_BUF5_POSN                                  0x5
#define _DMAnBUF_BUF5_POSITION                              0x5
#define _DMAnBUF_BUF5_SIZE                                  0x1
#define _DMAnBUF_BUF5_LENGTH                                0x1
#define _DMAnBUF_BUF5_MASK                                  0x20
#define _DMAnBUF_BUF6_POSN                                  0x6
#define _DMAnBUF_BUF6_POSITION                              0x6
#define _DMAnBUF_BUF6_SIZE                                  0x1
#define _DMAnBUF_BUF6_LENGTH                                0x1
#define _DMAnBUF_BUF6_MASK                                  0x40
#define _DMAnBUF_BUF7_POSN                                  0x7
#define _DMAnBUF_BUF7_POSITION                              0x7
#define _DMAnBUF_BUF7_SIZE                                  0x1
#define _DMAnBUF_BUF7_LENGTH                                0x1
#define _DMAnBUF_BUF7_MASK                                  0x80

// Register: DMAnDCNT
#define DMAnDCNT DMAnDCNT
extern volatile unsigned short          DMAnDCNT            __at(0x0EA);
#ifndef _LIB_BUILD
asm("DMAnDCNT equ 0EAh");
#endif

