MikroElektronika/core_packages/PIC/XC8/def/PIC18F55Q43/mcu.h
// Register: DMAnDCNTL
#define DMAnDCNTL DMAnDCNTL
extern volatile unsigned char           DMAnDCNTL           __at(0x0EA);
#ifndef _LIB_BUILD
asm("DMAnDCNTL equ 0EAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DCNT                   :8;
    };
    struct {
        unsigned DCNT0                  :1;
        unsigned DCNT1                  :1;
        unsigned DCNT2                  :1;
        unsigned DCNT3                  :1;
        unsigned DCNT4                  :1;
        unsigned DCNT5                  :1;
        unsigned DCNT6                  :1;
        unsigned DCNT7                  :1;
    };
} DMAnDCNTLbits_t;
extern volatile DMAnDCNTLbits_t DMAnDCNTLbits __at(0x0EA);
// bitfield macros
#define _DMAnDCNTL_DCNT_POSN                                0x0
#define _DMAnDCNTL_DCNT_POSITION                            0x0
#define _DMAnDCNTL_DCNT_SIZE                                0x8
#define _DMAnDCNTL_DCNT_LENGTH                              0x8
#define _DMAnDCNTL_DCNT_MASK                                0xFF
#define _DMAnDCNTL_DCNT0_POSN                               0x0
#define _DMAnDCNTL_DCNT0_POSITION                           0x0
#define _DMAnDCNTL_DCNT0_SIZE                               0x1
#define _DMAnDCNTL_DCNT0_LENGTH                             0x1
#define _DMAnDCNTL_DCNT0_MASK                               0x1
#define _DMAnDCNTL_DCNT1_POSN                               0x1
#define _DMAnDCNTL_DCNT1_POSITION                           0x1
#define _DMAnDCNTL_DCNT1_SIZE                               0x1
#define _DMAnDCNTL_DCNT1_LENGTH                             0x1
#define _DMAnDCNTL_DCNT1_MASK                               0x2
#define _DMAnDCNTL_DCNT2_POSN                               0x2
#define _DMAnDCNTL_DCNT2_POSITION                           0x2
#define _DMAnDCNTL_DCNT2_SIZE                               0x1
#define _DMAnDCNTL_DCNT2_LENGTH                             0x1
#define _DMAnDCNTL_DCNT2_MASK                               0x4
#define _DMAnDCNTL_DCNT3_POSN                               0x3
#define _DMAnDCNTL_DCNT3_POSITION                           0x3
#define _DMAnDCNTL_DCNT3_SIZE                               0x1
#define _DMAnDCNTL_DCNT3_LENGTH                             0x1
#define _DMAnDCNTL_DCNT3_MASK                               0x8
#define _DMAnDCNTL_DCNT4_POSN                               0x4
#define _DMAnDCNTL_DCNT4_POSITION                           0x4
#define _DMAnDCNTL_DCNT4_SIZE                               0x1
#define _DMAnDCNTL_DCNT4_LENGTH                             0x1
#define _DMAnDCNTL_DCNT4_MASK                               0x10
#define _DMAnDCNTL_DCNT5_POSN                               0x5
#define _DMAnDCNTL_DCNT5_POSITION                           0x5
#define _DMAnDCNTL_DCNT5_SIZE                               0x1
#define _DMAnDCNTL_DCNT5_LENGTH                             0x1
#define _DMAnDCNTL_DCNT5_MASK                               0x20
#define _DMAnDCNTL_DCNT6_POSN                               0x6
#define _DMAnDCNTL_DCNT6_POSITION                           0x6
#define _DMAnDCNTL_DCNT6_SIZE                               0x1
#define _DMAnDCNTL_DCNT6_LENGTH                             0x1
#define _DMAnDCNTL_DCNT6_MASK                               0x40
#define _DMAnDCNTL_DCNT7_POSN                               0x7
#define _DMAnDCNTL_DCNT7_POSITION                           0x7
#define _DMAnDCNTL_DCNT7_SIZE                               0x1
#define _DMAnDCNTL_DCNT7_LENGTH                             0x1
#define _DMAnDCNTL_DCNT7_MASK                               0x80

// Register: DMAnDCNTH
#define DMAnDCNTH DMAnDCNTH
extern volatile unsigned char           DMAnDCNTH           __at(0x0EB);
#ifndef _LIB_BUILD
asm("DMAnDCNTH equ 0EBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DCNT                   :8;
    };
    struct {
        unsigned DCNT8                  :1;
        unsigned DCNT9                  :1;
        unsigned DCNT10                 :1;
        unsigned DCNT11                 :1;
    };
} DMAnDCNTHbits_t;
extern volatile DMAnDCNTHbits_t DMAnDCNTHbits __at(0x0EB);
// bitfield macros
#define _DMAnDCNTH_DCNT_POSN                                0x0
#define _DMAnDCNTH_DCNT_POSITION                            0x0
#define _DMAnDCNTH_DCNT_SIZE                                0x8
#define _DMAnDCNTH_DCNT_LENGTH                              0x8
#define _DMAnDCNTH_DCNT_MASK                                0xFF
#define _DMAnDCNTH_DCNT8_POSN                               0x0
#define _DMAnDCNTH_DCNT8_POSITION                           0x0
#define _DMAnDCNTH_DCNT8_SIZE                               0x1
#define _DMAnDCNTH_DCNT8_LENGTH                             0x1
#define _DMAnDCNTH_DCNT8_MASK                               0x1
#define _DMAnDCNTH_DCNT9_POSN                               0x1
#define _DMAnDCNTH_DCNT9_POSITION                           0x1
#define _DMAnDCNTH_DCNT9_SIZE                               0x1
#define _DMAnDCNTH_DCNT9_LENGTH                             0x1
#define _DMAnDCNTH_DCNT9_MASK                               0x2
#define _DMAnDCNTH_DCNT10_POSN                              0x2
#define _DMAnDCNTH_DCNT10_POSITION                          0x2
#define _DMAnDCNTH_DCNT10_SIZE                              0x1
#define _DMAnDCNTH_DCNT10_LENGTH                            0x1
#define _DMAnDCNTH_DCNT10_MASK                              0x4
#define _DMAnDCNTH_DCNT11_POSN                              0x3
#define _DMAnDCNTH_DCNT11_POSITION                          0x3
#define _DMAnDCNTH_DCNT11_SIZE                              0x1
#define _DMAnDCNTH_DCNT11_LENGTH                            0x1
#define _DMAnDCNTH_DCNT11_MASK                              0x8

// Register: DMAnDPTR
#define DMAnDPTR DMAnDPTR
extern volatile unsigned short          DMAnDPTR            __at(0x0EC);
#ifndef _LIB_BUILD
asm("DMAnDPTR equ 0ECh");
#endif

// Register: DMAnDPTRL
#define DMAnDPTRL DMAnDPTRL
extern volatile unsigned char           DMAnDPTRL           __at(0x0EC);
#ifndef _LIB_BUILD
asm("DMAnDPTRL equ 0ECh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DPTR                   :8;
    };
    struct {
        unsigned DPTR0                  :1;
        unsigned DPTR1                  :1;
        unsigned DPTR2                  :1;
        unsigned DPTR3                  :1;
        unsigned DPTR4                  :1;
        unsigned DPTR5                  :1;
        unsigned DPTR6                  :1;
        unsigned DPTR7                  :1;
    };
} DMAnDPTRLbits_t;
