MikroElektronika/core_packages/PIC/XC8/def/PIC18F55Q43/mcu.h
// Register: DMAnSSAH
#define DMAnSSAH DMAnSSAH
extern volatile unsigned char           DMAnSSAH            __at(0x0FA);
#ifndef _LIB_BUILD
asm("DMAnSSAH equ 0FAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSA                    :8;
    };
    struct {
        unsigned SSA8                   :1;
        unsigned SSA9                   :1;
        unsigned SSA10                  :1;
        unsigned SSA11                  :1;
        unsigned SSA12                  :1;
        unsigned SSA13                  :1;
        unsigned SSA14                  :1;
        unsigned SSA15                  :1;
    };
} DMAnSSAHbits_t;
extern volatile DMAnSSAHbits_t DMAnSSAHbits __at(0x0FA);
// bitfield macros
#define _DMAnSSAH_SSA_POSN                                  0x0
#define _DMAnSSAH_SSA_POSITION                              0x0
#define _DMAnSSAH_SSA_SIZE                                  0x8
#define _DMAnSSAH_SSA_LENGTH                                0x8
#define _DMAnSSAH_SSA_MASK                                  0xFF
#define _DMAnSSAH_SSA8_POSN                                 0x0
#define _DMAnSSAH_SSA8_POSITION                             0x0
#define _DMAnSSAH_SSA8_SIZE                                 0x1
#define _DMAnSSAH_SSA8_LENGTH                               0x1
#define _DMAnSSAH_SSA8_MASK                                 0x1
#define _DMAnSSAH_SSA9_POSN                                 0x1
#define _DMAnSSAH_SSA9_POSITION                             0x1
#define _DMAnSSAH_SSA9_SIZE                                 0x1
#define _DMAnSSAH_SSA9_LENGTH                               0x1
#define _DMAnSSAH_SSA9_MASK                                 0x2
#define _DMAnSSAH_SSA10_POSN                                0x2
#define _DMAnSSAH_SSA10_POSITION                            0x2
#define _DMAnSSAH_SSA10_SIZE                                0x1
#define _DMAnSSAH_SSA10_LENGTH                              0x1
#define _DMAnSSAH_SSA10_MASK                                0x4
#define _DMAnSSAH_SSA11_POSN                                0x3
#define _DMAnSSAH_SSA11_POSITION                            0x3
#define _DMAnSSAH_SSA11_SIZE                                0x1
#define _DMAnSSAH_SSA11_LENGTH                              0x1
#define _DMAnSSAH_SSA11_MASK                                0x8
#define _DMAnSSAH_SSA12_POSN                                0x4
#define _DMAnSSAH_SSA12_POSITION                            0x4
#define _DMAnSSAH_SSA12_SIZE                                0x1
#define _DMAnSSAH_SSA12_LENGTH                              0x1
#define _DMAnSSAH_SSA12_MASK                                0x10
#define _DMAnSSAH_SSA13_POSN                                0x5
#define _DMAnSSAH_SSA13_POSITION                            0x5
#define _DMAnSSAH_SSA13_SIZE                                0x1
#define _DMAnSSAH_SSA13_LENGTH                              0x1
#define _DMAnSSAH_SSA13_MASK                                0x20
#define _DMAnSSAH_SSA14_POSN                                0x6
#define _DMAnSSAH_SSA14_POSITION                            0x6
#define _DMAnSSAH_SSA14_SIZE                                0x1
#define _DMAnSSAH_SSA14_LENGTH                              0x1
#define _DMAnSSAH_SSA14_MASK                                0x40
#define _DMAnSSAH_SSA15_POSN                                0x7
#define _DMAnSSAH_SSA15_POSITION                            0x7
#define _DMAnSSAH_SSA15_SIZE                                0x1
#define _DMAnSSAH_SSA15_LENGTH                              0x1
#define _DMAnSSAH_SSA15_MASK                                0x80

// Register: DMAnSSAU
#define DMAnSSAU DMAnSSAU
extern volatile unsigned char           DMAnSSAU            __at(0x0FB);
#ifndef _LIB_BUILD
asm("DMAnSSAU equ 0FBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSA                    :8;
    };
    struct {
        unsigned SSA16                  :1;
        unsigned SSA17                  :1;
        unsigned SSA18                  :1;
        unsigned SSA19                  :1;
        unsigned SSA20                  :1;
        unsigned SSA21                  :1;
    };
} DMAnSSAUbits_t;
extern volatile DMAnSSAUbits_t DMAnSSAUbits __at(0x0FB);
// bitfield macros
#define _DMAnSSAU_SSA_POSN                                  0x0
#define _DMAnSSAU_SSA_POSITION                              0x0
#define _DMAnSSAU_SSA_SIZE                                  0x8
#define _DMAnSSAU_SSA_LENGTH                                0x8
#define _DMAnSSAU_SSA_MASK                                  0xFF
#define _DMAnSSAU_SSA16_POSN                                0x0
#define _DMAnSSAU_SSA16_POSITION                            0x0
#define _DMAnSSAU_SSA16_SIZE                                0x1
#define _DMAnSSAU_SSA16_LENGTH                              0x1
#define _DMAnSSAU_SSA16_MASK                                0x1
#define _DMAnSSAU_SSA17_POSN                                0x1
#define _DMAnSSAU_SSA17_POSITION                            0x1
#define _DMAnSSAU_SSA17_SIZE                                0x1
#define _DMAnSSAU_SSA17_LENGTH                              0x1
#define _DMAnSSAU_SSA17_MASK                                0x2
#define _DMAnSSAU_SSA18_POSN                                0x2
#define _DMAnSSAU_SSA18_POSITION                            0x2
#define _DMAnSSAU_SSA18_SIZE                                0x1
#define _DMAnSSAU_SSA18_LENGTH                              0x1
#define _DMAnSSAU_SSA18_MASK                                0x4
#define _DMAnSSAU_SSA19_POSN                                0x3
#define _DMAnSSAU_SSA19_POSITION                            0x3
#define _DMAnSSAU_SSA19_SIZE                                0x1
#define _DMAnSSAU_SSA19_LENGTH                              0x1
#define _DMAnSSAU_SSA19_MASK                                0x8
#define _DMAnSSAU_SSA20_POSN                                0x4
#define _DMAnSSAU_SSA20_POSITION                            0x4
#define _DMAnSSAU_SSA20_SIZE                                0x1
#define _DMAnSSAU_SSA20_LENGTH                              0x1
#define _DMAnSSAU_SSA20_MASK                                0x10
#define _DMAnSSAU_SSA21_POSN                                0x5
#define _DMAnSSAU_SSA21_POSITION                            0x5
#define _DMAnSSAU_SSA21_SIZE                                0x1
#define _DMAnSSAU_SSA21_LENGTH                              0x1
#define _DMAnSSAU_SSA21_MASK                                0x20

// Register: DMAnCON0
#define DMAnCON0 DMAnCON0
extern volatile unsigned char           DMAnCON0            __at(0x0FC);
#ifndef _LIB_BUILD
asm("DMAnCON0 equ 0FCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned XIP                    :1;
        unsigned                        :1;
        unsigned AIRQEN                 :1;
        unsigned                        :2;
        unsigned DGO                    :1;
        unsigned SIRQEN                 :1;
        unsigned EN                     :1;
    };
} DMAnCON0bits_t;
extern volatile DMAnCON0bits_t DMAnCON0bits __at(0x0FC);
// bitfield macros
#define _DMAnCON0_XIP_POSN                                  0x0
#define _DMAnCON0_XIP_POSITION                              0x0
#define _DMAnCON0_XIP_SIZE                                  0x1
#define _DMAnCON0_XIP_LENGTH                                0x1
#define _DMAnCON0_XIP_MASK                                  0x1
#define _DMAnCON0_AIRQEN_POSN                               0x2
#define _DMAnCON0_AIRQEN_POSITION                           0x2
#define _DMAnCON0_AIRQEN_SIZE                               0x1
#define _DMAnCON0_AIRQEN_LENGTH                             0x1
#define _DMAnCON0_AIRQEN_MASK                               0x4
#define _DMAnCON0_DGO_POSN                                  0x5
#define _DMAnCON0_DGO_POSITION                              0x5
#define _DMAnCON0_DGO_SIZE                                  0x1
#define _DMAnCON0_DGO_LENGTH                                0x1
#define _DMAnCON0_DGO_MASK                                  0x20
#define _DMAnCON0_SIRQEN_POSN                               0x6
#define _DMAnCON0_SIRQEN_POSITION                           0x6
#define _DMAnCON0_SIRQEN_SIZE                               0x1
#define _DMAnCON0_SIRQEN_LENGTH                             0x1
#define _DMAnCON0_SIRQEN_MASK                               0x40
#define _DMAnCON0_EN_POSN                                   0x7
#define _DMAnCON0_EN_POSITION                               0x7
#define _DMAnCON0_EN_SIZE                                   0x1
#define _DMAnCON0_EN_LENGTH                                 0x1
#define _DMAnCON0_EN_MASK                                   0x80

