MikroElektronika/core_packages/PIC/XC8/def/PIC18F55Q43/mcu.h
extern volatile RE0PPSbits_t RE0PPSbits __at(0x221);
// bitfield macros
#define _RE0PPS_RE0PPS0_POSN                                0x0
#define _RE0PPS_RE0PPS0_POSITION                            0x0
#define _RE0PPS_RE0PPS0_SIZE                                0x1
#define _RE0PPS_RE0PPS0_LENGTH                              0x1
#define _RE0PPS_RE0PPS0_MASK                                0x1
#define _RE0PPS_RE0PPS1_POSN                                0x1
#define _RE0PPS_RE0PPS1_POSITION                            0x1
#define _RE0PPS_RE0PPS1_SIZE                                0x1
#define _RE0PPS_RE0PPS1_LENGTH                              0x1
#define _RE0PPS_RE0PPS1_MASK                                0x2
#define _RE0PPS_RE0PPS2_POSN                                0x2
#define _RE0PPS_RE0PPS2_POSITION                            0x2
#define _RE0PPS_RE0PPS2_SIZE                                0x1
#define _RE0PPS_RE0PPS2_LENGTH                              0x1
#define _RE0PPS_RE0PPS2_MASK                                0x4
#define _RE0PPS_RE0PPS3_POSN                                0x3
#define _RE0PPS_RE0PPS3_POSITION                            0x3
#define _RE0PPS_RE0PPS3_SIZE                                0x1
#define _RE0PPS_RE0PPS3_LENGTH                              0x1
#define _RE0PPS_RE0PPS3_MASK                                0x8
#define _RE0PPS_RE0PPS4_POSN                                0x4
#define _RE0PPS_RE0PPS4_POSITION                            0x4
#define _RE0PPS_RE0PPS4_SIZE                                0x1
#define _RE0PPS_RE0PPS4_LENGTH                              0x1
#define _RE0PPS_RE0PPS4_MASK                                0x10
#define _RE0PPS_RE0PPS5_POSN                                0x5
#define _RE0PPS_RE0PPS5_POSITION                            0x5
#define _RE0PPS_RE0PPS5_SIZE                                0x1
#define _RE0PPS_RE0PPS5_LENGTH                              0x1
#define _RE0PPS_RE0PPS5_MASK                                0x20
#define _RE0PPS_RE0PPS6_POSN                                0x6
#define _RE0PPS_RE0PPS6_POSITION                            0x6
#define _RE0PPS_RE0PPS6_SIZE                                0x1
#define _RE0PPS_RE0PPS6_LENGTH                              0x1
#define _RE0PPS_RE0PPS6_MASK                                0x40

// Register: RE1PPS
#define RE1PPS RE1PPS
extern volatile unsigned char           RE1PPS              __at(0x222);
#ifndef _LIB_BUILD
asm("RE1PPS equ 0222h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RE1PPS0                :1;
        unsigned RE1PPS1                :1;
        unsigned RE1PPS2                :1;
        unsigned RE1PPS3                :1;
        unsigned RE1PPS4                :1;
        unsigned RE1PPS5                :1;
        unsigned RE1PPS6                :1;
    };
} RE1PPSbits_t;
extern volatile RE1PPSbits_t RE1PPSbits __at(0x222);
// bitfield macros
#define _RE1PPS_RE1PPS0_POSN                                0x0
#define _RE1PPS_RE1PPS0_POSITION                            0x0
#define _RE1PPS_RE1PPS0_SIZE                                0x1
#define _RE1PPS_RE1PPS0_LENGTH                              0x1
#define _RE1PPS_RE1PPS0_MASK                                0x1
#define _RE1PPS_RE1PPS1_POSN                                0x1
#define _RE1PPS_RE1PPS1_POSITION                            0x1
#define _RE1PPS_RE1PPS1_SIZE                                0x1
#define _RE1PPS_RE1PPS1_LENGTH                              0x1
#define _RE1PPS_RE1PPS1_MASK                                0x2
#define _RE1PPS_RE1PPS2_POSN                                0x2
#define _RE1PPS_RE1PPS2_POSITION                            0x2
#define _RE1PPS_RE1PPS2_SIZE                                0x1
#define _RE1PPS_RE1PPS2_LENGTH                              0x1
#define _RE1PPS_RE1PPS2_MASK                                0x4
#define _RE1PPS_RE1PPS3_POSN                                0x3
#define _RE1PPS_RE1PPS3_POSITION                            0x3
#define _RE1PPS_RE1PPS3_SIZE                                0x1
#define _RE1PPS_RE1PPS3_LENGTH                              0x1
#define _RE1PPS_RE1PPS3_MASK                                0x8
#define _RE1PPS_RE1PPS4_POSN                                0x4
#define _RE1PPS_RE1PPS4_POSITION                            0x4
#define _RE1PPS_RE1PPS4_SIZE                                0x1
#define _RE1PPS_RE1PPS4_LENGTH                              0x1
#define _RE1PPS_RE1PPS4_MASK                                0x10
#define _RE1PPS_RE1PPS5_POSN                                0x5
#define _RE1PPS_RE1PPS5_POSITION                            0x5
#define _RE1PPS_RE1PPS5_SIZE                                0x1
#define _RE1PPS_RE1PPS5_LENGTH                              0x1
#define _RE1PPS_RE1PPS5_MASK                                0x20
#define _RE1PPS_RE1PPS6_POSN                                0x6
#define _RE1PPS_RE1PPS6_POSITION                            0x6
#define _RE1PPS_RE1PPS6_SIZE                                0x1
#define _RE1PPS_RE1PPS6_LENGTH                              0x1
#define _RE1PPS_RE1PPS6_MASK                                0x40

// Register: RE2PPS
#define RE2PPS RE2PPS
extern volatile unsigned char           RE2PPS              __at(0x223);
#ifndef _LIB_BUILD
asm("RE2PPS equ 0223h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RE2PPS0                :1;
        unsigned RE2PPS1                :1;
        unsigned RE2PPS2                :1;
        unsigned RE2PPS3                :1;
        unsigned RE2PPS4                :1;
        unsigned RE2PPS5                :1;
        unsigned RE2PPS6                :1;
    };
} RE2PPSbits_t;
extern volatile RE2PPSbits_t RE2PPSbits __at(0x223);
// bitfield macros
#define _RE2PPS_RE2PPS0_POSN                                0x0
#define _RE2PPS_RE2PPS0_POSITION                            0x0
#define _RE2PPS_RE2PPS0_SIZE                                0x1
#define _RE2PPS_RE2PPS0_LENGTH                              0x1
#define _RE2PPS_RE2PPS0_MASK                                0x1
#define _RE2PPS_RE2PPS1_POSN                                0x1
#define _RE2PPS_RE2PPS1_POSITION                            0x1
#define _RE2PPS_RE2PPS1_SIZE                                0x1
#define _RE2PPS_RE2PPS1_LENGTH                              0x1
#define _RE2PPS_RE2PPS1_MASK                                0x2
#define _RE2PPS_RE2PPS2_POSN                                0x2
#define _RE2PPS_RE2PPS2_POSITION                            0x2
#define _RE2PPS_RE2PPS2_SIZE                                0x1
#define _RE2PPS_RE2PPS2_LENGTH                              0x1
#define _RE2PPS_RE2PPS2_MASK                                0x4
#define _RE2PPS_RE2PPS3_POSN                                0x3
#define _RE2PPS_RE2PPS3_POSITION                            0x3
#define _RE2PPS_RE2PPS3_SIZE                                0x1
#define _RE2PPS_RE2PPS3_LENGTH                              0x1
#define _RE2PPS_RE2PPS3_MASK                                0x8
#define _RE2PPS_RE2PPS4_POSN                                0x4
#define _RE2PPS_RE2PPS4_POSITION                            0x4
#define _RE2PPS_RE2PPS4_SIZE                                0x1
#define _RE2PPS_RE2PPS4_LENGTH                              0x1
#define _RE2PPS_RE2PPS4_MASK                                0x10
#define _RE2PPS_RE2PPS5_POSN                                0x5
#define _RE2PPS_RE2PPS5_POSITION                            0x5
#define _RE2PPS_RE2PPS5_SIZE                                0x1
#define _RE2PPS_RE2PPS5_LENGTH                              0x1
#define _RE2PPS_RE2PPS5_MASK                                0x20
#define _RE2PPS_RE2PPS6_POSN                                0x6
#define _RE2PPS_RE2PPS6_POSITION                            0x6
#define _RE2PPS_RE2PPS6_SIZE                                0x1
#define _RE2PPS_RE2PPS6_LENGTH                              0x1
#define _RE2PPS_RE2PPS6_MASK                                0x40

// Register: RF0PPS
#define RF0PPS RF0PPS
extern volatile unsigned char           RF0PPS              __at(0x229);
#ifndef _LIB_BUILD
asm("RF0PPS equ 0229h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RF0PPS0                :1;
        unsigned RF0PPS1                :1;
        unsigned RF0PPS2                :1;
        unsigned RF0PPS3                :1;
        unsigned RF0PPS4                :1;
        unsigned RF0PPS5                :1;
        unsigned RF0PPS6                :1;
    };
} RF0PPSbits_t;
extern volatile RF0PPSbits_t RF0PPSbits __at(0x229);
// bitfield macros
#define _RF0PPS_RF0PPS0_POSN                                0x0
#define _RF0PPS_RF0PPS0_POSITION                            0x0
#define _RF0PPS_RF0PPS0_SIZE                                0x1
#define _RF0PPS_RF0PPS0_LENGTH                              0x1
#define _RF0PPS_RF0PPS0_MASK                                0x1
#define _RF0PPS_RF0PPS1_POSN                                0x1
#define _RF0PPS_RF0PPS1_POSITION                            0x1
#define _RF0PPS_RF0PPS1_SIZE                                0x1
#define _RF0PPS_RF0PPS1_LENGTH                              0x1
#define _RF0PPS_RF0PPS1_MASK                                0x2
#define _RF0PPS_RF0PPS2_POSN                                0x2
#define _RF0PPS_RF0PPS2_POSITION                            0x2
#define _RF0PPS_RF0PPS2_SIZE                                0x1
#define _RF0PPS_RF0PPS2_LENGTH                              0x1
#define _RF0PPS_RF0PPS2_MASK                                0x4
#define _RF0PPS_RF0PPS3_POSN                                0x3
#define _RF0PPS_RF0PPS3_POSITION                            0x3
#define _RF0PPS_RF0PPS3_SIZE                                0x1
#define _RF0PPS_RF0PPS3_LENGTH                              0x1
#define _RF0PPS_RF0PPS3_MASK                                0x8
#define _RF0PPS_RF0PPS4_POSN                                0x4
#define _RF0PPS_RF0PPS4_POSITION                            0x4
#define _RF0PPS_RF0PPS4_SIZE                                0x1
#define _RF0PPS_RF0PPS4_LENGTH                              0x1
#define _RF0PPS_RF0PPS4_MASK                                0x10
#define _RF0PPS_RF0PPS5_POSN                                0x5
#define _RF0PPS_RF0PPS5_POSITION                            0x5
#define _RF0PPS_RF0PPS5_SIZE                                0x1
#define _RF0PPS_RF0PPS5_LENGTH                              0x1
#define _RF0PPS_RF0PPS5_MASK                                0x20
#define _RF0PPS_RF0PPS6_POSN                                0x6
#define _RF0PPS_RF0PPS6_POSITION                            0x6
#define _RF0PPS_RF0PPS6_SIZE                                0x1
#define _RF0PPS_RF0PPS6_LENGTH                              0x1
#define _RF0PPS_RF0PPS6_MASK                                0x40

// Register: RF1PPS
#define RF1PPS RF1PPS
extern volatile unsigned char           RF1PPS              __at(0x22A);
#ifndef _LIB_BUILD
asm("RF1PPS equ 022Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RF1PPS0                :1;
        unsigned RF1PPS1                :1;
        unsigned RF1PPS2                :1;
        unsigned RF1PPS3                :1;
        unsigned RF1PPS4                :1;
        unsigned RF1PPS5                :1;
        unsigned RF1PPS6                :1;
    };
} RF1PPSbits_t;
extern volatile RF1PPSbits_t RF1PPSbits __at(0x22A);
// bitfield macros
#define _RF1PPS_RF1PPS0_POSN                                0x0
#define _RF1PPS_RF1PPS0_POSITION                            0x0
#define _RF1PPS_RF1PPS0_SIZE                                0x1
#define _RF1PPS_RF1PPS0_LENGTH                              0x1
#define _RF1PPS_RF1PPS0_MASK                                0x1
#define _RF1PPS_RF1PPS1_POSN                                0x1
#define _RF1PPS_RF1PPS1_POSITION                            0x1
#define _RF1PPS_RF1PPS1_SIZE                                0x1
#define _RF1PPS_RF1PPS1_LENGTH                              0x1
#define _RF1PPS_RF1PPS1_MASK                                0x2
#define _RF1PPS_RF1PPS2_POSN                                0x2
#define _RF1PPS_RF1PPS2_POSITION                            0x2
#define _RF1PPS_RF1PPS2_SIZE                                0x1
#define _RF1PPS_RF1PPS2_LENGTH                              0x1
#define _RF1PPS_RF1PPS2_MASK                                0x4
#define _RF1PPS_RF1PPS3_POSN                                0x3
#define _RF1PPS_RF1PPS3_POSITION                            0x3
#define _RF1PPS_RF1PPS3_SIZE                                0x1
#define _RF1PPS_RF1PPS3_LENGTH                              0x1
#define _RF1PPS_RF1PPS3_MASK                                0x8
#define _RF1PPS_RF1PPS4_POSN                                0x4
#define _RF1PPS_RF1PPS4_POSITION                            0x4
#define _RF1PPS_RF1PPS4_SIZE                                0x1
#define _RF1PPS_RF1PPS4_LENGTH                              0x1
#define _RF1PPS_RF1PPS4_MASK                                0x10
#define _RF1PPS_RF1PPS5_POSN                                0x5
#define _RF1PPS_RF1PPS5_POSITION                            0x5
#define _RF1PPS_RF1PPS5_SIZE                                0x1
#define _RF1PPS_RF1PPS5_LENGTH                              0x1
#define _RF1PPS_RF1PPS5_MASK                                0x20
#define _RF1PPS_RF1PPS6_POSN                                0x6
#define _RF1PPS_RF1PPS6_POSITION                            0x6
#define _RF1PPS_RF1PPS6_SIZE                                0x1
#define _RF1PPS_RF1PPS6_LENGTH                              0x1
#define _RF1PPS_RF1PPS6_MASK                                0x40

// Register: RF2PPS
#define RF2PPS RF2PPS
extern volatile unsigned char           RF2PPS              __at(0x22B);
#ifndef _LIB_BUILD
asm("RF2PPS equ 022Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RF2PPS0                :1;
        unsigned RF2PPS1                :1;
        unsigned RF2PPS2                :1;
        unsigned RF2PPS3                :1;
        unsigned RF2PPS4                :1;
        unsigned RF2PPS5                :1;
        unsigned RF2PPS6                :1;
    };
} RF2PPSbits_t;
extern volatile RF2PPSbits_t RF2PPSbits __at(0x22B);
// bitfield macros
#define _RF2PPS_RF2PPS0_POSN                                0x0
#define _RF2PPS_RF2PPS0_POSITION                            0x0
#define _RF2PPS_RF2PPS0_SIZE                                0x1
#define _RF2PPS_RF2PPS0_LENGTH                              0x1
#define _RF2PPS_RF2PPS0_MASK                                0x1
#define _RF2PPS_RF2PPS1_POSN                                0x1
#define _RF2PPS_RF2PPS1_POSITION                            0x1
#define _RF2PPS_RF2PPS1_SIZE                                0x1
#define _RF2PPS_RF2PPS1_LENGTH                              0x1
#define _RF2PPS_RF2PPS1_MASK                                0x2
#define _RF2PPS_RF2PPS2_POSN                                0x2
#define _RF2PPS_RF2PPS2_POSITION                            0x2
#define _RF2PPS_RF2PPS2_SIZE                                0x1
#define _RF2PPS_RF2PPS2_LENGTH                              0x1
#define _RF2PPS_RF2PPS2_MASK                                0x4
#define _RF2PPS_RF2PPS3_POSN                                0x3
#define _RF2PPS_RF2PPS3_POSITION                            0x3
#define _RF2PPS_RF2PPS3_SIZE                                0x1
#define _RF2PPS_RF2PPS3_LENGTH                              0x1
#define _RF2PPS_RF2PPS3_MASK                                0x8
#define _RF2PPS_RF2PPS4_POSN                                0x4
#define _RF2PPS_RF2PPS4_POSITION                            0x4
#define _RF2PPS_RF2PPS4_SIZE                                0x1
#define _RF2PPS_RF2PPS4_LENGTH                              0x1
#define _RF2PPS_RF2PPS4_MASK                                0x10
#define _RF2PPS_RF2PPS5_POSN                                0x5
#define _RF2PPS_RF2PPS5_POSITION                            0x5
#define _RF2PPS_RF2PPS5_SIZE                                0x1
#define _RF2PPS_RF2PPS5_LENGTH                              0x1
#define _RF2PPS_RF2PPS5_MASK                                0x20
#define _RF2PPS_RF2PPS6_POSN                                0x6
#define _RF2PPS_RF2PPS6_POSITION                            0x6
#define _RF2PPS_RF2PPS6_SIZE                                0x1
#define _RF2PPS_RF2PPS6_LENGTH                              0x1
#define _RF2PPS_RF2PPS6_MASK                                0x40

