MikroElektronika/core_packages/PIC/XC8/def/PIC18F55Q43/mcu.h
extern volatile CWG3CLKCONbits_t CWG3CLKCONbits __at(0x3CE);
// bitfield macros
#define _CWG3CLKCON_CS_POSN                                 0x0
#define _CWG3CLKCON_CS_POSITION                             0x0
#define _CWG3CLKCON_CS_SIZE                                 0x1
#define _CWG3CLKCON_CS_LENGTH                               0x1
#define _CWG3CLKCON_CS_MASK                                 0x1
#define _CWG3CLKCON_CWG3CS_POSN                             0x0
#define _CWG3CLKCON_CWG3CS_POSITION                         0x0
#define _CWG3CLKCON_CWG3CS_SIZE                             0x1
#define _CWG3CLKCON_CWG3CS_LENGTH                           0x1
#define _CWG3CLKCON_CWG3CS_MASK                             0x1

// Register: CWG3ISM
#define CWG3ISM CWG3ISM
extern volatile unsigned char           CWG3ISM             __at(0x3CF);
#ifndef _LIB_BUILD
asm("CWG3ISM equ 03CFh");
#endif
// aliases
extern volatile unsigned char           CWG3DAT             __at(0x3CF);
#ifndef _LIB_BUILD
asm("CWG3DAT equ 03CFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ISM                    :8;
    };
    struct {
        unsigned CWG3ISM                :8;
    };
    struct {
        unsigned ISM0                   :1;
        unsigned ISM1                   :1;
        unsigned ISM2                   :1;
        unsigned ISM3                   :1;
        unsigned ISM4                   :1;
    };
} CWG3ISMbits_t;
extern volatile CWG3ISMbits_t CWG3ISMbits __at(0x3CF);
// bitfield macros
#define _CWG3ISM_ISM_POSN                                   0x0
#define _CWG3ISM_ISM_POSITION                               0x0
#define _CWG3ISM_ISM_SIZE                                   0x8
#define _CWG3ISM_ISM_LENGTH                                 0x8
#define _CWG3ISM_ISM_MASK                                   0xFF
#define _CWG3ISM_CWG3ISM_POSN                               0x0
#define _CWG3ISM_CWG3ISM_POSITION                           0x0
#define _CWG3ISM_CWG3ISM_SIZE                               0x8
#define _CWG3ISM_CWG3ISM_LENGTH                             0x8
#define _CWG3ISM_CWG3ISM_MASK                               0xFF
#define _CWG3ISM_ISM0_POSN                                  0x0
#define _CWG3ISM_ISM0_POSITION                              0x0
#define _CWG3ISM_ISM0_SIZE                                  0x1
#define _CWG3ISM_ISM0_LENGTH                                0x1
#define _CWG3ISM_ISM0_MASK                                  0x1
#define _CWG3ISM_ISM1_POSN                                  0x1
#define _CWG3ISM_ISM1_POSITION                              0x1
#define _CWG3ISM_ISM1_SIZE                                  0x1
#define _CWG3ISM_ISM1_LENGTH                                0x1
#define _CWG3ISM_ISM1_MASK                                  0x2
#define _CWG3ISM_ISM2_POSN                                  0x2
#define _CWG3ISM_ISM2_POSITION                              0x2
#define _CWG3ISM_ISM2_SIZE                                  0x1
#define _CWG3ISM_ISM2_LENGTH                                0x1
#define _CWG3ISM_ISM2_MASK                                  0x4
#define _CWG3ISM_ISM3_POSN                                  0x3
#define _CWG3ISM_ISM3_POSITION                              0x3
#define _CWG3ISM_ISM3_SIZE                                  0x1
#define _CWG3ISM_ISM3_LENGTH                                0x1
#define _CWG3ISM_ISM3_MASK                                  0x8
#define _CWG3ISM_ISM4_POSN                                  0x4
#define _CWG3ISM_ISM4_POSITION                              0x4
#define _CWG3ISM_ISM4_SIZE                                  0x1
#define _CWG3ISM_ISM4_LENGTH                                0x1
#define _CWG3ISM_ISM4_MASK                                  0x10
// alias bitfield definitions
typedef union {
    struct {
        unsigned ISM                    :8;
    };
    struct {
        unsigned CWG3ISM                :8;
    };
    struct {
        unsigned ISM0                   :1;
        unsigned ISM1                   :1;
        unsigned ISM2                   :1;
        unsigned ISM3                   :1;
        unsigned ISM4                   :1;
    };
} CWG3DATbits_t;
extern volatile CWG3DATbits_t CWG3DATbits __at(0x3CF);
// bitfield macros
#define _CWG3DAT_ISM_POSN                                   0x0
#define _CWG3DAT_ISM_POSITION                               0x0
#define _CWG3DAT_ISM_SIZE                                   0x8
#define _CWG3DAT_ISM_LENGTH                                 0x8
#define _CWG3DAT_ISM_MASK                                   0xFF
#define _CWG3DAT_CWG3ISM_POSN                               0x0
#define _CWG3DAT_CWG3ISM_POSITION                           0x0
#define _CWG3DAT_CWG3ISM_SIZE                               0x8
#define _CWG3DAT_CWG3ISM_LENGTH                             0x8
#define _CWG3DAT_CWG3ISM_MASK                               0xFF
#define _CWG3DAT_ISM0_POSN                                  0x0
#define _CWG3DAT_ISM0_POSITION                              0x0
#define _CWG3DAT_ISM0_SIZE                                  0x1
#define _CWG3DAT_ISM0_LENGTH                                0x1
#define _CWG3DAT_ISM0_MASK                                  0x1
#define _CWG3DAT_ISM1_POSN                                  0x1
#define _CWG3DAT_ISM1_POSITION                              0x1
#define _CWG3DAT_ISM1_SIZE                                  0x1
#define _CWG3DAT_ISM1_LENGTH                                0x1
#define _CWG3DAT_ISM1_MASK                                  0x2
#define _CWG3DAT_ISM2_POSN                                  0x2
#define _CWG3DAT_ISM2_POSITION                              0x2
#define _CWG3DAT_ISM2_SIZE                                  0x1
#define _CWG3DAT_ISM2_LENGTH                                0x1
#define _CWG3DAT_ISM2_MASK                                  0x4
#define _CWG3DAT_ISM3_POSN                                  0x3
#define _CWG3DAT_ISM3_POSITION                              0x3
#define _CWG3DAT_ISM3_SIZE                                  0x1
#define _CWG3DAT_ISM3_LENGTH                                0x1
#define _CWG3DAT_ISM3_MASK                                  0x8
#define _CWG3DAT_ISM4_POSN                                  0x4
#define _CWG3DAT_ISM4_POSITION                              0x4
#define _CWG3DAT_ISM4_SIZE                                  0x1
#define _CWG3DAT_ISM4_LENGTH                                0x1
#define _CWG3DAT_ISM4_MASK                                  0x10

