MikroElektronika/core_packages/PIC/XC8/def/PIC18F55Q43/mcu.h
extern volatile PIR14bits_t PIR14bits __at(0x4BC);
// bitfield macros
#define _PIR14_CLC7IF_POSN                                  0x1
#define _PIR14_CLC7IF_POSITION                              0x1
#define _PIR14_CLC7IF_SIZE                                  0x1
#define _PIR14_CLC7IF_LENGTH                                0x1
#define _PIR14_CLC7IF_MASK                                  0x2
#define _PIR14_C2IF_POSN                                    0x2
#define _PIR14_C2IF_POSITION                                0x2
#define _PIR14_C2IF_SIZE                                    0x1
#define _PIR14_C2IF_LENGTH                                  0x1
#define _PIR14_C2IF_MASK                                    0x4
#define _PIR14_NCO3IF_POSN                                  0x3
#define _PIR14_NCO3IF_POSITION                              0x3
#define _PIR14_NCO3IF_SIZE                                  0x1
#define _PIR14_NCO3IF_LENGTH                                0x1
#define _PIR14_NCO3IF_MASK                                  0x8

// Register: PIR15
#define PIR15 PIR15
extern volatile unsigned char           PIR15               __at(0x4BD);
#ifndef _LIB_BUILD
asm("PIR15 equ 04BDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NVMIF                  :1;
        unsigned CLC8IF                 :1;
        unsigned CRCIF                  :1;
        unsigned TMR6IF                 :1;
    };
} PIR15bits_t;
extern volatile PIR15bits_t PIR15bits __at(0x4BD);
// bitfield macros
#define _PIR15_NVMIF_POSN                                   0x0
#define _PIR15_NVMIF_POSITION                               0x0
#define _PIR15_NVMIF_SIZE                                   0x1
#define _PIR15_NVMIF_LENGTH                                 0x1
#define _PIR15_NVMIF_MASK                                   0x1
#define _PIR15_CLC8IF_POSN                                  0x1
#define _PIR15_CLC8IF_POSITION                              0x1
#define _PIR15_CLC8IF_SIZE                                  0x1
#define _PIR15_CLC8IF_LENGTH                                0x1
#define _PIR15_CLC8IF_MASK                                  0x2
#define _PIR15_CRCIF_POSN                                   0x2
#define _PIR15_CRCIF_POSITION                               0x2
#define _PIR15_CRCIF_SIZE                                   0x1
#define _PIR15_CRCIF_LENGTH                                 0x1
#define _PIR15_CRCIF_MASK                                   0x4
#define _PIR15_TMR6IF_POSN                                  0x3
#define _PIR15_TMR6IF_POSITION                              0x3
#define _PIR15_TMR6IF_SIZE                                  0x1
#define _PIR15_TMR6IF_LENGTH                                0x1
#define _PIR15_TMR6IF_MASK                                  0x8

// Register: LATA
#define LATA LATA
extern volatile unsigned char           LATA                __at(0x4BE);
#ifndef _LIB_BUILD
asm("LATA equ 04BEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LATA0                  :1;
        unsigned LATA1                  :1;
        unsigned LATA2                  :1;
        unsigned LATA3                  :1;
        unsigned LATA4                  :1;
        unsigned LATA5                  :1;
        unsigned LATA6                  :1;
        unsigned LATA7                  :1;
    };
} LATAbits_t;
extern volatile LATAbits_t LATAbits __at(0x4BE);
// bitfield macros
#define _LATA_LATA0_POSN                                    0x0
#define _LATA_LATA0_POSITION                                0x0
#define _LATA_LATA0_SIZE                                    0x1
#define _LATA_LATA0_LENGTH                                  0x1
#define _LATA_LATA0_MASK                                    0x1
#define _LATA_LATA1_POSN                                    0x1
#define _LATA_LATA1_POSITION                                0x1
#define _LATA_LATA1_SIZE                                    0x1
#define _LATA_LATA1_LENGTH                                  0x1
#define _LATA_LATA1_MASK                                    0x2
#define _LATA_LATA2_POSN                                    0x2
#define _LATA_LATA2_POSITION                                0x2
#define _LATA_LATA2_SIZE                                    0x1
#define _LATA_LATA2_LENGTH                                  0x1
#define _LATA_LATA2_MASK                                    0x4
#define _LATA_LATA3_POSN                                    0x3
#define _LATA_LATA3_POSITION                                0x3
#define _LATA_LATA3_SIZE                                    0x1
#define _LATA_LATA3_LENGTH                                  0x1
#define _LATA_LATA3_MASK                                    0x8
#define _LATA_LATA4_POSN                                    0x4
#define _LATA_LATA4_POSITION                                0x4
#define _LATA_LATA4_SIZE                                    0x1
#define _LATA_LATA4_LENGTH                                  0x1
#define _LATA_LATA4_MASK                                    0x10
#define _LATA_LATA5_POSN                                    0x5
#define _LATA_LATA5_POSITION                                0x5
#define _LATA_LATA5_SIZE                                    0x1
#define _LATA_LATA5_LENGTH                                  0x1
#define _LATA_LATA5_MASK                                    0x20
#define _LATA_LATA6_POSN                                    0x6
#define _LATA_LATA6_POSITION                                0x6
#define _LATA_LATA6_SIZE                                    0x1
#define _LATA_LATA6_LENGTH                                  0x1
#define _LATA_LATA6_MASK                                    0x40
#define _LATA_LATA7_POSN                                    0x7
#define _LATA_LATA7_POSITION                                0x7
#define _LATA_LATA7_SIZE                                    0x1
#define _LATA_LATA7_LENGTH                                  0x1
#define _LATA_LATA7_MASK                                    0x80

// Register: LATB
#define LATB LATB
extern volatile unsigned char           LATB                __at(0x4BF);
#ifndef _LIB_BUILD
asm("LATB equ 04BFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LATB0                  :1;
        unsigned LATB1                  :1;
        unsigned LATB2                  :1;
        unsigned LATB3                  :1;
        unsigned LATB4                  :1;
        unsigned LATB5                  :1;
        unsigned LATB6                  :1;
        unsigned LATB7                  :1;
    };
} LATBbits_t;
extern volatile LATBbits_t LATBbits __at(0x4BF);
// bitfield macros
#define _LATB_LATB0_POSN                                    0x0
#define _LATB_LATB0_POSITION                                0x0
#define _LATB_LATB0_SIZE                                    0x1
#define _LATB_LATB0_LENGTH                                  0x1
#define _LATB_LATB0_MASK                                    0x1
#define _LATB_LATB1_POSN                                    0x1
#define _LATB_LATB1_POSITION                                0x1
#define _LATB_LATB1_SIZE                                    0x1
#define _LATB_LATB1_LENGTH                                  0x1
#define _LATB_LATB1_MASK                                    0x2
#define _LATB_LATB2_POSN                                    0x2
#define _LATB_LATB2_POSITION                                0x2
#define _LATB_LATB2_SIZE                                    0x1
#define _LATB_LATB2_LENGTH                                  0x1
#define _LATB_LATB2_MASK                                    0x4
#define _LATB_LATB3_POSN                                    0x3
#define _LATB_LATB3_POSITION                                0x3
#define _LATB_LATB3_SIZE                                    0x1
#define _LATB_LATB3_LENGTH                                  0x1
#define _LATB_LATB3_MASK                                    0x8
#define _LATB_LATB4_POSN                                    0x4
#define _LATB_LATB4_POSITION                                0x4
#define _LATB_LATB4_SIZE                                    0x1
#define _LATB_LATB4_LENGTH                                  0x1
#define _LATB_LATB4_MASK                                    0x10
#define _LATB_LATB5_POSN                                    0x5
#define _LATB_LATB5_POSITION                                0x5
#define _LATB_LATB5_SIZE                                    0x1
#define _LATB_LATB5_LENGTH                                  0x1
#define _LATB_LATB5_MASK                                    0x20
#define _LATB_LATB6_POSN                                    0x6
#define _LATB_LATB6_POSITION                                0x6
#define _LATB_LATB6_SIZE                                    0x1
#define _LATB_LATB6_LENGTH                                  0x1
#define _LATB_LATB6_MASK                                    0x40
#define _LATB_LATB7_POSN                                    0x7
#define _LATB_LATB7_POSITION                                0x7
#define _LATB_LATB7_SIZE                                    0x1
#define _LATB_LATB7_LENGTH                                  0x1
#define _LATB_LATB7_MASK                                    0x80

