MikroElektronika/core_packages/PIC/XC8/def/PIC18F55Q43/mcu.h
#define _BIT_ACCESS(r,b) ___mkstr(BANKMASK(r)) "," ___mkstr(b)
#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr)&0FFFFFh)
#endif
// I2C1CON2<ABD>
extern volatile __bit                   ABD                 __at(0x14B4);	// @ (0x296 * 8 + 4)
#define                                 ABD_bit             _BIT_ACCESS(I2C1CON2,4)
// ADACCU<ACC20>
extern volatile __bit                   ACC20               __at(0x1F2C);	// @ (0x3E5 * 8 + 4)
#define                                 ACC20_bit           _BIT_ACCESS(ADACCU,4)
// ADACCU<ACC21>
extern volatile __bit                   ACC21               __at(0x1F2D);	// @ (0x3E5 * 8 + 5)
#define                                 ACC21_bit           _BIT_ACCESS(ADACCU,5)
// ADACCU<ACC22>
extern volatile __bit                   ACC22               __at(0x1F2E);	// @ (0x3E5 * 8 + 6)
#define                                 ACC22_bit           _BIT_ACCESS(ADACCU,6)
// ADACCU<ACC23>
extern volatile __bit                   ACC23               __at(0x1F2F);	// @ (0x3E5 * 8 + 7)
#define                                 ACC23_bit           _BIT_ACCESS(ADACCU,7)
// CRCCON0<ACCM>
extern volatile __bit                   ACCM                __at(0x1ABC);	// @ (0x357 * 8 + 4)
#define                                 ACCM_bit            _BIT_ACCESS(CRCCON0,4)
// I2C1CON1<ACKCNT>
extern volatile __bit                   ACKCNT              __at(0x14AF);	// @ (0x295 * 8 + 7)
#define                                 ACKCNT_bit          _BIT_ACCESS(I2C1CON1,7)
// I2C1CON1<ACKDT>
extern volatile __bit                   ACKDT               __at(0x14AE);	// @ (0x295 * 8 + 6)
#define                                 ACKDT_bit           _BIT_ACCESS(I2C1CON1,6)
// I2C1CON1<ACKSTAT>
extern volatile __bit                   ACKSTAT             __at(0x14AD);	// @ (0x295 * 8 + 5)
#define                                 ACKSTAT_bit         _BIT_ACCESS(I2C1CON1,5)
// I2C1CON1<ACKT>
extern volatile __bit                   ACKT                __at(0x14AC);	// @ (0x295 * 8 + 4)
#define                                 ACKT_bit            _BIT_ACCESS(I2C1CON1,4)
// I2C1PIE<ACKT1IE>
extern volatile __bit                   ACKT1IE             __at(0x14DE);	// @ (0x29B * 8 + 6)
#define                                 ACKT1IE_bit         _BIT_ACCESS(I2C1PIE,6)
// I2C1PIR<ACKT1IF>
extern volatile __bit                   ACKT1IF             __at(0x14D6);	// @ (0x29A * 8 + 6)
#define                                 ACKT1IF_bit         _BIT_ACCESS(I2C1PIR,6)
// I2C1PIE<ACKTIE>
extern volatile __bit                   ACKTIE              __at(0x14DE);	// @ (0x29B * 8 + 6)
#define                                 ACKTIE_bit          _BIT_ACCESS(I2C1PIE,6)
// I2C1PIR<ACKTIF>
extern volatile __bit                   ACKTIF              __at(0x14D6);	// @ (0x29A * 8 + 6)
#define                                 ACKTIF_bit          _BIT_ACCESS(I2C1PIR,6)
// ADCON2<ACLR>
extern volatile __bit                   ACLR                __at(0x1FAB);	// @ (0x3F5 * 8 + 3)
#define                                 ACLR_bit            _BIT_ACCESS(ADCON2,3)
// I2C1CON2<ACNT>
extern volatile __bit                   ACNT                __at(0x14B7);	// @ (0x296 * 8 + 7)
#define                                 ACNT_bit            _BIT_ACCESS(I2C1CON2,7)
// ADACQL<ACQ0>
extern volatile __bit                   ACQ0                __at(0x1F70);	// @ (0x3EE * 8 + 0)
#define                                 ACQ0_bit            _BIT_ACCESS(ADACQL,0)
// ADACQL<ACQ1>
extern volatile __bit                   ACQ1                __at(0x1F71);	// @ (0x3EE * 8 + 1)
#define                                 ACQ1_bit            _BIT_ACCESS(ADACQL,1)
// ADACQH<ACQ10>
extern volatile __bit                   ACQ10               __at(0x1F7A);	// @ (0x3EF * 8 + 2)
#define                                 ACQ10_bit           _BIT_ACCESS(ADACQH,2)
// ADACQH<ACQ11>
extern volatile __bit                   ACQ11               __at(0x1F7B);	// @ (0x3EF * 8 + 3)
#define                                 ACQ11_bit           _BIT_ACCESS(ADACQH,3)
// ADACQH<ACQ12>
extern volatile __bit                   ACQ12               __at(0x1F7C);	// @ (0x3EF * 8 + 4)
#define                                 ACQ12_bit           _BIT_ACCESS(ADACQH,4)
// ADACQL<ACQ2>
extern volatile __bit                   ACQ2                __at(0x1F72);	// @ (0x3EE * 8 + 2)
#define                                 ACQ2_bit            _BIT_ACCESS(ADACQL,2)
// ADACQL<ACQ3>
extern volatile __bit                   ACQ3                __at(0x1F73);	// @ (0x3EE * 8 + 3)
#define                                 ACQ3_bit            _BIT_ACCESS(ADACQL,3)
// ADACQL<ACQ4>
extern volatile __bit                   ACQ4                __at(0x1F74);	// @ (0x3EE * 8 + 4)
#define                                 ACQ4_bit            _BIT_ACCESS(ADACQL,4)
// ADACQL<ACQ5>
extern volatile __bit                   ACQ5                __at(0x1F75);	// @ (0x3EE * 8 + 5)
#define                                 ACQ5_bit            _BIT_ACCESS(ADACQL,5)
// ADACQL<ACQ6>
extern volatile __bit                   ACQ6                __at(0x1F76);	// @ (0x3EE * 8 + 6)
#define                                 ACQ6_bit            _BIT_ACCESS(ADACQL,6)
// ADACQL<ACQ7>
extern volatile __bit                   ACQ7                __at(0x1F77);	// @ (0x3EE * 8 + 7)
#define                                 ACQ7_bit            _BIT_ACCESS(ADACQL,7)
// ADACQH<ACQ8>
extern volatile __bit                   ACQ8                __at(0x1F78);	// @ (0x3EF * 8 + 0)
#define                                 ACQ8_bit            _BIT_ACCESS(ADACQH,0)
// ADACQH<ACQ9>
extern volatile __bit                   ACQ9                __at(0x1F79);	// @ (0x3EF * 8 + 1)
#define                                 ACQ9_bit            _BIT_ACCESS(ADACQH,1)
// TBLPTRU<ACSS>
extern volatile __bit                   ACSS                __at(0x27C5);	// @ (0x4F8 * 8 + 5)
#define                                 ACSS_bit            _BIT_ACCESS(TBLPTRU,5)
// ADACT<ACT0>
extern volatile __bit                   ACT0                __at(0x1FC8);	// @ (0x3F9 * 8 + 0)
#define                                 ACT0_bit            _BIT_ACCESS(ADACT,0)
// ADACT<ACT1>
extern volatile __bit                   ACT1                __at(0x1FC9);	// @ (0x3F9 * 8 + 1)
#define                                 ACT1_bit            _BIT_ACCESS(ADACT,1)
// ADACT<ACT2>
extern volatile __bit                   ACT2                __at(0x1FCA);	// @ (0x3F9 * 8 + 2)
#define                                 ACT2_bit            _BIT_ACCESS(ADACT,2)
// ADACT<ACT3>
extern volatile __bit                   ACT3                __at(0x1FCB);	// @ (0x3F9 * 8 + 3)
#define                                 ACT3_bit            _BIT_ACCESS(ADACT,3)
// ADACT<ACT4>
extern volatile __bit                   ACT4                __at(0x1FCC);	// @ (0x3F9 * 8 + 4)
#define                                 ACT4_bit            _BIT_ACCESS(ADACT,4)
// ADACT<ACT5>
extern volatile __bit                   ACT5                __at(0x1FCD);	// @ (0x3F9 * 8 + 5)
#define                                 ACT5_bit            _BIT_ACCESS(ADACT,5)
// ACTCON<ACTEN>
extern volatile __bit                   ACTEN               __at(0x567);	// @ (0xAC * 8 + 7)
#define                                 ACTEN_bit           _BIT_ACCESS(ACTCON,7)
// PIE1<ACTIE>
extern volatile __bit                   ACTIE               __at(0x24FB);	// @ (0x49F * 8 + 3)
#define                                 ACTIE_bit           _BIT_ACCESS(PIE1,3)
// PIR1<ACTIF>
extern volatile __bit                   ACTIF               __at(0x257B);	// @ (0x4AF * 8 + 3)
#define                                 ACTIF_bit           _BIT_ACCESS(PIR1,3)
// IPR1<ACTIP>
extern volatile __bit                   ACTIP               __at(0x1B1B);	// @ (0x363 * 8 + 3)
#define                                 ACTIP_bit           _BIT_ACCESS(IPR1,3)
// ACTCON<ACTLOCK>
extern volatile __bit                   ACTLOCK             __at(0x563);	// @ (0xAC * 8 + 3)
#define                                 ACTLOCK_bit         _BIT_ACCESS(ACTCON,3)
// PMD3<ACTMD>
extern volatile __bit                   ACTMD               __at(0x31F);	// @ (0x63 * 8 + 7)
#define                                 ACTMD_bit           _BIT_ACCESS(PMD3,7)
// ACTCON<ACTORS>
extern volatile __bit                   ACTORS              __at(0x561);	// @ (0xAC * 8 + 1)
#define                                 ACTORS_bit          _BIT_ACCESS(ACTCON,1)
// ACTCON<ACTUD>
extern volatile __bit                   ACTUD               __at(0x566);	// @ (0xAC * 8 + 6)
#define                                 ACTUD_bit           _BIT_ACCESS(ACTCON,6)
// IVTADL<AD0>
extern volatile __bit                   AD0                 __at(0x22D0);	// @ (0x45A * 8 + 0)
#define                                 AD0_bit             _BIT_ACCESS(IVTADL,0)
// IVTADL<AD1>
extern volatile __bit                   AD1                 __at(0x22D1);	// @ (0x45A * 8 + 1)
#define                                 AD1_bit             _BIT_ACCESS(IVTADL,1)
// IVTADH<AD10>
extern volatile __bit                   AD10                __at(0x22DA);	// @ (0x45B * 8 + 2)
#define                                 AD10_bit            _BIT_ACCESS(IVTADH,2)
// IVTADH<AD11>
extern volatile __bit                   AD11                __at(0x22DB);	// @ (0x45B * 8 + 3)
#define                                 AD11_bit            _BIT_ACCESS(IVTADH,3)
// IVTADH<AD12>
extern volatile __bit                   AD12                __at(0x22DC);	// @ (0x45B * 8 + 4)
#define                                 AD12_bit            _BIT_ACCESS(IVTADH,4)
// IVTADH<AD13>
extern volatile __bit                   AD13                __at(0x22DD);	// @ (0x45B * 8 + 5)
#define                                 AD13_bit            _BIT_ACCESS(IVTADH,5)
// IVTADH<AD14>
extern volatile __bit                   AD14                __at(0x22DE);	// @ (0x45B * 8 + 6)
#define                                 AD14_bit            _BIT_ACCESS(IVTADH,6)
// IVTADH<AD15>
extern volatile __bit                   AD15                __at(0x22DF);	// @ (0x45B * 8 + 7)
#define                                 AD15_bit            _BIT_ACCESS(IVTADH,7)
// IVTADU<AD16>
extern volatile __bit                   AD16                __at(0x22E0);	// @ (0x45C * 8 + 0)
#define                                 AD16_bit            _BIT_ACCESS(IVTADU,0)
// IVTADU<AD17>
extern volatile __bit                   AD17                __at(0x22E1);	// @ (0x45C * 8 + 1)
#define                                 AD17_bit            _BIT_ACCESS(IVTADU,1)
// IVTADU<AD18>
extern volatile __bit                   AD18                __at(0x22E2);	// @ (0x45C * 8 + 2)
#define                                 AD18_bit            _BIT_ACCESS(IVTADU,2)
// IVTADU<AD19>
extern volatile __bit                   AD19                __at(0x22E3);	// @ (0x45C * 8 + 3)
#define                                 AD19_bit            _BIT_ACCESS(IVTADU,3)
// IVTADL<AD2>
extern volatile __bit                   AD2                 __at(0x22D2);	// @ (0x45A * 8 + 2)
#define                                 AD2_bit             _BIT_ACCESS(IVTADL,2)
// IVTADU<AD20>
extern volatile __bit                   AD20                __at(0x22E4);	// @ (0x45C * 8 + 4)
#define                                 AD20_bit            _BIT_ACCESS(IVTADU,4)
// IVTADL<AD3>
extern volatile __bit                   AD3                 __at(0x22D3);	// @ (0x45A * 8 + 3)
#define                                 AD3_bit             _BIT_ACCESS(IVTADL,3)
// IVTADL<AD4>
extern volatile __bit                   AD4                 __at(0x22D4);	// @ (0x45A * 8 + 4)
#define                                 AD4_bit             _BIT_ACCESS(IVTADL,4)
// IVTADL<AD5>
extern volatile __bit                   AD5                 __at(0x22D5);	// @ (0x45A * 8 + 5)
#define                                 AD5_bit             _BIT_ACCESS(IVTADL,5)
// IVTADL<AD6>
extern volatile __bit                   AD6                 __at(0x22D6);	// @ (0x45A * 8 + 6)
#define                                 AD6_bit             _BIT_ACCESS(IVTADL,6)
// IVTADL<AD7>
extern volatile __bit                   AD7                 __at(0x22D7);	// @ (0x45A * 8 + 7)
#define                                 AD7_bit             _BIT_ACCESS(IVTADL,7)
// IVTADH<AD8>
extern volatile __bit                   AD8                 __at(0x22D8);	// @ (0x45B * 8 + 0)
#define                                 AD8_bit             _BIT_ACCESS(IVTADH,0)
// IVTADH<AD9>
extern volatile __bit                   AD9                 __at(0x22D9);	// @ (0x45B * 8 + 1)
#define                                 AD9_bit             _BIT_ACCESS(IVTADH,1)
// ADACCL<ADACC0>
extern volatile __bit                   ADACC0              __at(0x1F18);	// @ (0x3E3 * 8 + 0)
#define                                 ADACC0_bit          _BIT_ACCESS(ADACCL,0)
// ADACCL<ADACC1>
extern volatile __bit                   ADACC1              __at(0x1F19);	// @ (0x3E3 * 8 + 1)
#define                                 ADACC1_bit          _BIT_ACCESS(ADACCL,1)
// ADACCH<ADACC10>
extern volatile __bit                   ADACC10             __at(0x1F22);	// @ (0x3E4 * 8 + 2)
#define                                 ADACC10_bit         _BIT_ACCESS(ADACCH,2)
// ADACCH<ADACC11>
extern volatile __bit                   ADACC11             __at(0x1F23);	// @ (0x3E4 * 8 + 3)
#define                                 ADACC11_bit         _BIT_ACCESS(ADACCH,3)
// ADACCH<ADACC12>
extern volatile __bit                   ADACC12             __at(0x1F24);	// @ (0x3E4 * 8 + 4)
#define                                 ADACC12_bit         _BIT_ACCESS(ADACCH,4)
// ADACCH<ADACC13>
extern volatile __bit                   ADACC13             __at(0x1F25);	// @ (0x3E4 * 8 + 5)
#define                                 ADACC13_bit         _BIT_ACCESS(ADACCH,5)
// ADACCH<ADACC14>
extern volatile __bit                   ADACC14             __at(0x1F26);	// @ (0x3E4 * 8 + 6)
#define                                 ADACC14_bit         _BIT_ACCESS(ADACCH,6)
// ADACCH<ADACC15>
extern volatile __bit                   ADACC15             __at(0x1F27);	// @ (0x3E4 * 8 + 7)
#define                                 ADACC15_bit         _BIT_ACCESS(ADACCH,7)
// ADACCU<ADACC16>
extern volatile __bit                   ADACC16             __at(0x1F28);	// @ (0x3E5 * 8 + 0)
#define                                 ADACC16_bit         _BIT_ACCESS(ADACCU,0)
// ADACCU<ADACC17>
extern volatile __bit                   ADACC17             __at(0x1F29);	// @ (0x3E5 * 8 + 1)
#define                                 ADACC17_bit         _BIT_ACCESS(ADACCU,1)
// ADACCU<ADACC18>
extern volatile __bit                   ADACC18             __at(0x1F2A);	// @ (0x3E5 * 8 + 2)
#define                                 ADACC18_bit         _BIT_ACCESS(ADACCU,2)
// ADACCU<ADACC19>
extern volatile __bit                   ADACC19             __at(0x1F2B);	// @ (0x3E5 * 8 + 3)
#define                                 ADACC19_bit         _BIT_ACCESS(ADACCU,3)
// ADACCL<ADACC2>
extern volatile __bit                   ADACC2              __at(0x1F1A);	// @ (0x3E3 * 8 + 2)
#define                                 ADACC2_bit          _BIT_ACCESS(ADACCL,2)
// ADACCU<ADACC20>
extern volatile __bit                   ADACC20             __at(0x1F2C);	// @ (0x3E5 * 8 + 4)
#define                                 ADACC20_bit         _BIT_ACCESS(ADACCU,4)
// ADACCU<ADACC21>
extern volatile __bit                   ADACC21             __at(0x1F2D);	// @ (0x3E5 * 8 + 5)
#define                                 ADACC21_bit         _BIT_ACCESS(ADACCU,5)
// ADACCU<ADACC22>
extern volatile __bit                   ADACC22             __at(0x1F2E);	// @ (0x3E5 * 8 + 6)
#define                                 ADACC22_bit         _BIT_ACCESS(ADACCU,6)
// ADACCU<ADACC23>
extern volatile __bit                   ADACC23             __at(0x1F2F);	// @ (0x3E5 * 8 + 7)
#define                                 ADACC23_bit         _BIT_ACCESS(ADACCU,7)
// ADACCL<ADACC3>
extern volatile __bit                   ADACC3              __at(0x1F1B);	// @ (0x3E3 * 8 + 3)
#define                                 ADACC3_bit          _BIT_ACCESS(ADACCL,3)
// ADACCL<ADACC4>
extern volatile __bit                   ADACC4              __at(0x1F1C);	// @ (0x3E3 * 8 + 4)
#define                                 ADACC4_bit          _BIT_ACCESS(ADACCL,4)
// ADACCL<ADACC5>
extern volatile __bit                   ADACC5              __at(0x1F1D);	// @ (0x3E3 * 8 + 5)
#define                                 ADACC5_bit          _BIT_ACCESS(ADACCL,5)
// ADACCL<ADACC6>
extern volatile __bit                   ADACC6              __at(0x1F1E);	// @ (0x3E3 * 8 + 6)
#define                                 ADACC6_bit          _BIT_ACCESS(ADACCL,6)
// ADACCL<ADACC7>
extern volatile __bit                   ADACC7              __at(0x1F1F);	// @ (0x3E3 * 8 + 7)
#define                                 ADACC7_bit          _BIT_ACCESS(ADACCL,7)
// ADACCH<ADACC8>
extern volatile __bit                   ADACC8              __at(0x1F20);	// @ (0x3E4 * 8 + 0)
#define                                 ADACC8_bit          _BIT_ACCESS(ADACCH,0)
// ADACCH<ADACC9>
extern volatile __bit                   ADACC9              __at(0x1F21);	// @ (0x3E4 * 8 + 1)
#define                                 ADACC9_bit          _BIT_ACCESS(ADACCH,1)
// ADCON2<ADACLR>
extern volatile __bit                   ADACLR              __at(0x1FAB);	// @ (0x3F5 * 8 + 3)
#define                                 ADACLR_bit          _BIT_ACCESS(ADCON2,3)
// ADACQL<ADACQ0>
extern volatile __bit                   ADACQ0              __at(0x1F70);	// @ (0x3EE * 8 + 0)
#define                                 ADACQ0_bit          _BIT_ACCESS(ADACQL,0)
// ADACQL<ADACQ1>
extern volatile __bit                   ADACQ1              __at(0x1F71);	// @ (0x3EE * 8 + 1)
#define                                 ADACQ1_bit          _BIT_ACCESS(ADACQL,1)
// ADACQH<ADACQ10>
extern volatile __bit                   ADACQ10             __at(0x1F7A);	// @ (0x3EF * 8 + 2)
#define                                 ADACQ10_bit         _BIT_ACCESS(ADACQH,2)
// ADACQH<ADACQ11>
extern volatile __bit                   ADACQ11             __at(0x1F7B);	// @ (0x3EF * 8 + 3)
#define                                 ADACQ11_bit         _BIT_ACCESS(ADACQH,3)
// ADACQH<ADACQ12>
extern volatile __bit                   ADACQ12             __at(0x1F7C);	// @ (0x3EF * 8 + 4)
#define                                 ADACQ12_bit         _BIT_ACCESS(ADACQH,4)
// ADACQL<ADACQ2>
extern volatile __bit                   ADACQ2              __at(0x1F72);	// @ (0x3EE * 8 + 2)
#define                                 ADACQ2_bit          _BIT_ACCESS(ADACQL,2)
// ADACQL<ADACQ3>
extern volatile __bit                   ADACQ3              __at(0x1F73);	// @ (0x3EE * 8 + 3)
#define                                 ADACQ3_bit          _BIT_ACCESS(ADACQL,3)
// ADACQL<ADACQ4>
extern volatile __bit                   ADACQ4              __at(0x1F74);	// @ (0x3EE * 8 + 4)
#define                                 ADACQ4_bit          _BIT_ACCESS(ADACQL,4)
// ADACQL<ADACQ5>
extern volatile __bit                   ADACQ5              __at(0x1F75);	// @ (0x3EE * 8 + 5)
#define                                 ADACQ5_bit          _BIT_ACCESS(ADACQL,5)
// ADACQL<ADACQ6>
extern volatile __bit                   ADACQ6              __at(0x1F76);	// @ (0x3EE * 8 + 6)
#define                                 ADACQ6_bit          _BIT_ACCESS(ADACQL,6)
// ADACQL<ADACQ7>
extern volatile __bit                   ADACQ7              __at(0x1F77);	// @ (0x3EE * 8 + 7)
#define                                 ADACQ7_bit          _BIT_ACCESS(ADACQL,7)
// ADACQH<ADACQ8>
extern volatile __bit                   ADACQ8              __at(0x1F78);	// @ (0x3EF * 8 + 0)
#define                                 ADACQ8_bit          _BIT_ACCESS(ADACQH,0)
// ADACQH<ADACQ9>
extern volatile __bit                   ADACQ9              __at(0x1F79);	// @ (0x3EF * 8 + 1)
#define                                 ADACQ9_bit          _BIT_ACCESS(ADACQH,1)
// ADACT<ADACT0>
extern volatile __bit                   ADACT0              __at(0x1FC8);	// @ (0x3F9 * 8 + 0)
#define                                 ADACT0_bit          _BIT_ACCESS(ADACT,0)
// ADACT<ADACT1>
extern volatile __bit                   ADACT1              __at(0x1FC9);	// @ (0x3F9 * 8 + 1)
#define                                 ADACT1_bit          _BIT_ACCESS(ADACT,1)
// ADACT<ADACT2>
extern volatile __bit                   ADACT2              __at(0x1FCA);	// @ (0x3F9 * 8 + 2)
#define                                 ADACT2_bit          _BIT_ACCESS(ADACT,2)
// ADACT<ADACT3>
extern volatile __bit                   ADACT3              __at(0x1FCB);	// @ (0x3F9 * 8 + 3)
#define                                 ADACT3_bit          _BIT_ACCESS(ADACT,3)
// ADACT<ADACT4>
extern volatile __bit                   ADACT4              __at(0x1FCC);	// @ (0x3F9 * 8 + 4)
#define                                 ADACT4_bit          _BIT_ACCESS(ADACT,4)
// ADACT<ADACT5>
extern volatile __bit                   ADACT5              __at(0x1FCD);	// @ (0x3F9 * 8 + 5)
#define                                 ADACT5_bit          _BIT_ACCESS(ADACT,5)
// ADACTPPS<ADACTPPS0>
extern volatile __bit                   ADACTPPS0           __at(0x1348);	// @ (0x269 * 8 + 0)
#define                                 ADACTPPS0_bit       _BIT_ACCESS(ADACTPPS,0)
// ADACTPPS<ADACTPPS1>
extern volatile __bit                   ADACTPPS1           __at(0x1349);	// @ (0x269 * 8 + 1)
#define                                 ADACTPPS1_bit       _BIT_ACCESS(ADACTPPS,1)
// ADACTPPS<ADACTPPS2>
extern volatile __bit                   ADACTPPS2           __at(0x134A);	// @ (0x269 * 8 + 2)
#define                                 ADACTPPS2_bit       _BIT_ACCESS(ADACTPPS,2)
// ADACTPPS<ADACTPPS3>
extern volatile __bit                   ADACTPPS3           __at(0x134B);	// @ (0x269 * 8 + 3)
#define                                 ADACTPPS3_bit       _BIT_ACCESS(ADACTPPS,3)
// ADACTPPS<ADACTPPS4>
extern volatile __bit                   ADACTPPS4           __at(0x134C);	// @ (0x269 * 8 + 4)
#define                                 ADACTPPS4_bit       _BIT_ACCESS(ADACTPPS,4)
// ADSTAT<ADAOV>
extern volatile __bit                   ADAOV               __at(0x1FBF);	// @ (0x3F7 * 8 + 7)
#define                                 ADAOV_bit           _BIT_ACCESS(ADSTAT,7)
// ADCON3<ADCALC0>
extern volatile __bit                   ADCALC0             __at(0x1FB4);	// @ (0x3F6 * 8 + 4)
#define                                 ADCALC0_bit         _BIT_ACCESS(ADCON3,4)
// ADCON3<ADCALC1>
extern volatile __bit                   ADCALC1             __at(0x1FB5);	// @ (0x3F6 * 8 + 5)
#define                                 ADCALC1_bit         _BIT_ACCESS(ADCON3,5)
// ADCON3<ADCALC2>
extern volatile __bit                   ADCALC2             __at(0x1FB6);	// @ (0x3F6 * 8 + 6)
#define                                 ADCALC2_bit         _BIT_ACCESS(ADCON3,6)
// ADCAP<ADCAP0>
extern volatile __bit                   ADCAP0              __at(0x1F80);	// @ (0x3F0 * 8 + 0)
#define                                 ADCAP0_bit          _BIT_ACCESS(ADCAP,0)
// ADCAP<ADCAP1>
extern volatile __bit                   ADCAP1              __at(0x1F81);	// @ (0x3F0 * 8 + 1)
#define                                 ADCAP1_bit          _BIT_ACCESS(ADCAP,1)
// ADCAP<ADCAP2>
extern volatile __bit                   ADCAP2              __at(0x1F82);	// @ (0x3F0 * 8 + 2)
#define                                 ADCAP2_bit          _BIT_ACCESS(ADCAP,2)
// ADCAP<ADCAP3>
extern volatile __bit                   ADCAP3              __at(0x1F83);	// @ (0x3F0 * 8 + 3)
#define                                 ADCAP3_bit          _BIT_ACCESS(ADCAP,3)
// ADCAP<ADCAP4>
extern volatile __bit                   ADCAP4              __at(0x1F84);	// @ (0x3F0 * 8 + 4)
