MikroElektronika/core_packages/PIC/XC8/def/PIC18F55Q43/mcu.h
#define                                 U2RXPPS0_bit        _BIT_ACCESS(U2RXPPS,0)
// U2RXPPS<U2RXPPS1>
extern volatile __bit                   U2RXPPS1            __at(0x13A1);	// @ (0x274 * 8 + 1)
#define                                 U2RXPPS1_bit        _BIT_ACCESS(U2RXPPS,1)
// U2RXPPS<U2RXPPS2>
extern volatile __bit                   U2RXPPS2            __at(0x13A2);	// @ (0x274 * 8 + 2)
#define                                 U2RXPPS2_bit        _BIT_ACCESS(U2RXPPS,2)
// U2RXPPS<U2RXPPS3>
extern volatile __bit                   U2RXPPS3            __at(0x13A3);	// @ (0x274 * 8 + 3)
#define                                 U2RXPPS3_bit        _BIT_ACCESS(U2RXPPS,3)
// U2RXPPS<U2RXPPS4>
extern volatile __bit                   U2RXPPS4            __at(0x13A4);	// @ (0x274 * 8 + 4)
#define                                 U2RXPPS4_bit        _BIT_ACCESS(U2RXPPS,4)
// U2CON1<U2SENDB>
extern volatile __bit                   U2SENDB             __at(0x15F8);	// @ (0x2BF * 8 + 0)
#define                                 U2SENDB_bit         _BIT_ACCESS(U2CON1,0)
// U2CON2<U2STP0>
extern volatile __bit                   U2STP0              __at(0x1604);	// @ (0x2C0 * 8 + 4)
#define                                 U2STP0_bit          _BIT_ACCESS(U2CON2,4)
// U2CON2<U2STP1>
extern volatile __bit                   U2STP1              __at(0x1605);	// @ (0x2C0 * 8 + 5)
#define                                 U2STP1_bit          _BIT_ACCESS(U2CON2,5)
// U2FIFO<U2STPMD>
extern volatile __bit                   U2STPMD             __at(0x161E);	// @ (0x2C3 * 8 + 6)
#define                                 U2STPMD_bit         _BIT_ACCESS(U2FIFO,6)
// U2FIFO<U2TXBE>
extern volatile __bit                   U2TXBE              __at(0x161D);	// @ (0x2C3 * 8 + 5)
#define                                 U2TXBE_bit          _BIT_ACCESS(U2FIFO,5)
// U2FIFO<U2TXBF>
extern volatile __bit                   U2TXBF              __at(0x161C);	// @ (0x2C3 * 8 + 4)
#define                                 U2TXBF_bit          _BIT_ACCESS(U2FIFO,4)
// U2ERRIE<U2TXCIE>
extern volatile __bit                   U2TXCIE             __at(0x1630);	// @ (0x2C6 * 8 + 0)
#define                                 U2TXCIE_bit         _BIT_ACCESS(U2ERRIE,0)
// U2ERRIR<U2TXCIF>
extern volatile __bit                   U2TXCIF             __at(0x1628);	// @ (0x2C5 * 8 + 0)
#define                                 U2TXCIF_bit         _BIT_ACCESS(U2ERRIR,0)
// U2CON0<U2TXEN>
extern volatile __bit                   U2TXEN              __at(0x15F5);	// @ (0x2BE * 8 + 5)
#define                                 U2TXEN_bit          _BIT_ACCESS(U2CON0,5)
// PIE8<U2TXIE>
extern volatile __bit                   U2TXIE              __at(0x2531);	// @ (0x4A6 * 8 + 1)
#define                                 U2TXIE_bit          _BIT_ACCESS(PIE8,1)
// PIR8<U2TXIF>
extern volatile __bit                   U2TXIF              __at(0x25B1);	// @ (0x4B6 * 8 + 1)
#define                                 U2TXIF_bit          _BIT_ACCESS(PIR8,1)
// IPR8<U2TXIP>
extern volatile __bit                   U2TXIP              __at(0x1B51);	// @ (0x36A * 8 + 1)
#define                                 U2TXIP_bit          _BIT_ACCESS(IPR8,1)
// U2ERRIE<U2TXMTIE>
extern volatile __bit                   U2TXMTIE            __at(0x1637);	// @ (0x2C6 * 8 + 7)
#define                                 U2TXMTIE_bit        _BIT_ACCESS(U2ERRIE,7)
// U2ERRIR<U2TXMTIF>
extern volatile __bit                   U2TXMTIF            __at(0x162F);	// @ (0x2C5 * 8 + 7)
#define                                 U2TXMTIF_bit        _BIT_ACCESS(U2ERRIR,7)
// U2CON2<U2TXPOL>
extern volatile __bit                   U2TXPOL             __at(0x1602);	// @ (0x2C0 * 8 + 2)
#define                                 U2TXPOL_bit         _BIT_ACCESS(U2CON2,2)
// U2FIFO<U2TXWRE>
extern volatile __bit                   U2TXWRE             __at(0x161F);	// @ (0x2C3 * 8 + 7)
#define                                 U2TXWRE_bit         _BIT_ACCESS(U2FIFO,7)
// U2CON1<U2WUE>
extern volatile __bit                   U2WUE               __at(0x15FC);	// @ (0x2BF * 8 + 4)
#define                                 U2WUE_bit           _BIT_ACCESS(U2CON1,4)
// U2UIR<U2WUIF>
extern volatile __bit                   U2WUIF              __at(0x1627);	// @ (0x2C4 * 8 + 7)
#define                                 U2WUIF_bit          _BIT_ACCESS(U2UIR,7)
// U2FIFO<U2XON>
extern volatile __bit                   U2XON               __at(0x161A);	// @ (0x2C3 * 8 + 2)
#define                                 U2XON_bit           _BIT_ACCESS(U2FIFO,2)
// U3CON0<U3ABDEN>
extern volatile __bit                   U3ABDEN             __at(0x168E);	// @ (0x2D1 * 8 + 6)
#define                                 U3ABDEN_bit         _BIT_ACCESS(U3CON0,6)
// U3UIR<U3ABDIE>
extern volatile __bit                   U3ABDIE             __at(0x16BA);	// @ (0x2D7 * 8 + 2)
#define                                 U3ABDIE_bit         _BIT_ACCESS(U3UIR,2)
// U3UIR<U3ABDIF>
extern volatile __bit                   U3ABDIF             __at(0x16BE);	// @ (0x2D7 * 8 + 6)
#define                                 U3ABDIF_bit         _BIT_ACCESS(U3UIR,6)
// U3ERRIE<U3ABDOVE>
extern volatile __bit                   U3ABDOVE            __at(0x16CD);	// @ (0x2D9 * 8 + 5)
#define                                 U3ABDOVE_bit        _BIT_ACCESS(U3ERRIE,5)
// U3ERRIR<U3ABDOVF>
extern volatile __bit                   U3ABDOVF            __at(0x16C5);	// @ (0x2D8 * 8 + 5)
#define                                 U3ABDOVF_bit        _BIT_ACCESS(U3ERRIR,5)
// U3CON0<U3BRGS>
extern volatile __bit                   U3BRGS              __at(0x168F);	// @ (0x2D1 * 8 + 7)
#define                                 U3BRGS_bit          _BIT_ACCESS(U3CON0,7)
// U3CON1<U3BRKOVR>
extern volatile __bit                   U3BRKOVR            __at(0x1691);	// @ (0x2D2 * 8 + 1)
#define                                 U3BRKOVR_bit        _BIT_ACCESS(U3CON1,1)
// U3ERRIE<U3CERIE>
extern volatile __bit                   U3CERIE             __at(0x16CC);	// @ (0x2D9 * 8 + 4)
#define                                 U3CERIE_bit         _BIT_ACCESS(U3ERRIE,4)
// U3ERRIR<U3CERIF>
extern volatile __bit                   U3CERIF             __at(0x16C4);	// @ (0x2D8 * 8 + 4)
#define                                 U3CERIF_bit         _BIT_ACCESS(U3ERRIR,4)
// U3CTSPPS<U3CTSPPS0>
extern volatile __bit                   U3CTSPPS0           __at(0x13B8);	// @ (0x277 * 8 + 0)
#define                                 U3CTSPPS0_bit       _BIT_ACCESS(U3CTSPPS,0)
// U3CTSPPS<U3CTSPPS1>
extern volatile __bit                   U3CTSPPS1           __at(0x13B9);	// @ (0x277 * 8 + 1)
#define                                 U3CTSPPS1_bit       _BIT_ACCESS(U3CTSPPS,1)
// U3CTSPPS<U3CTSPPS2>
extern volatile __bit                   U3CTSPPS2           __at(0x13BA);	// @ (0x277 * 8 + 2)
#define                                 U3CTSPPS2_bit       _BIT_ACCESS(U3CTSPPS,2)
// U3CTSPPS<U3CTSPPS3>
extern volatile __bit                   U3CTSPPS3           __at(0x13BB);	// @ (0x277 * 8 + 3)
#define                                 U3CTSPPS3_bit       _BIT_ACCESS(U3CTSPPS,3)
// U3CTSPPS<U3CTSPPS4>
extern volatile __bit                   U3CTSPPS4           __at(0x13BC);	// @ (0x277 * 8 + 4)
#define                                 U3CTSPPS4_bit       _BIT_ACCESS(U3CTSPPS,4)
// U3CTSPPS<U3CTSPPS5>
extern volatile __bit                   U3CTSPPS5           __at(0x13BD);	// @ (0x277 * 8 + 5)
#define                                 U3CTSPPS5_bit       _BIT_ACCESS(U3CTSPPS,5)
// PIE9<U3EIE>
extern volatile __bit                   U3EIE               __at(0x253A);	// @ (0x4A7 * 8 + 2)
#define                                 U3EIE_bit           _BIT_ACCESS(PIE9,2)
// PIR9<U3EIF>
extern volatile __bit                   U3EIF               __at(0x25BA);	// @ (0x4B7 * 8 + 2)
#define                                 U3EIF_bit           _BIT_ACCESS(PIR9,2)
// IPR9<U3EIP>
extern volatile __bit                   U3EIP               __at(0x1B5A);	// @ (0x36B * 8 + 2)
#define                                 U3EIP_bit           _BIT_ACCESS(IPR9,2)
// U3ERRIE<U3FERIE>
extern volatile __bit                   U3FERIE             __at(0x16CB);	// @ (0x2D9 * 8 + 3)
#define                                 U3FERIE_bit         _BIT_ACCESS(U3ERRIE,3)
// U3ERRIR<U3FERIF>
extern volatile __bit                   U3FERIF             __at(0x16C3);	// @ (0x2D8 * 8 + 3)
#define                                 U3FERIF_bit         _BIT_ACCESS(U3ERRIR,3)
// U3CON2<U3FLO0>
extern volatile __bit                   U3FLO0              __at(0x1698);	// @ (0x2D3 * 8 + 0)
#define                                 U3FLO0_bit          _BIT_ACCESS(U3CON2,0)
// U3CON2<U3FLO1>
extern volatile __bit                   U3FLO1              __at(0x1699);	// @ (0x2D3 * 8 + 1)
#define                                 U3FLO1_bit          _BIT_ACCESS(U3CON2,1)
// PIE9<U3IE>
extern volatile __bit                   U3IE                __at(0x253B);	// @ (0x4A7 * 8 + 3)
#define                                 U3IE_bit            _BIT_ACCESS(PIE9,3)
// PIR9<U3IF>
extern volatile __bit                   U3IF                __at(0x25BB);	// @ (0x4B7 * 8 + 3)
#define                                 U3IF_bit            _BIT_ACCESS(PIR9,3)
// IPR9<U3IP>
extern volatile __bit                   U3IP                __at(0x1B5B);	// @ (0x36B * 8 + 3)
#define                                 U3IP_bit            _BIT_ACCESS(IPR9,3)
// PMD6<U3MD>
extern volatile __bit                   U3MD                __at(0x335);	// @ (0x66 * 8 + 5)
#define                                 U3MD_bit            _BIT_ACCESS(PMD6,5)
// U3CON0<U3MODE0>
extern volatile __bit                   U3MODE0             __at(0x1688);	// @ (0x2D1 * 8 + 0)
#define                                 U3MODE0_bit         _BIT_ACCESS(U3CON0,0)
// U3CON0<U3MODE1>
extern volatile __bit                   U3MODE1             __at(0x1689);	// @ (0x2D1 * 8 + 1)
#define                                 U3MODE1_bit         _BIT_ACCESS(U3CON0,1)
// U3CON0<U3MODE2>
extern volatile __bit                   U3MODE2             __at(0x168A);	// @ (0x2D1 * 8 + 2)
#define                                 U3MODE2_bit         _BIT_ACCESS(U3CON0,2)
// U3CON1<U3ON>
extern volatile __bit                   U3ON                __at(0x1697);	// @ (0x2D2 * 8 + 7)
#define                                 U3ON_bit            _BIT_ACCESS(U3CON1,7)
// U3ERRIE<U3PERIE>
extern volatile __bit                   U3PERIE             __at(0x16CE);	// @ (0x2D9 * 8 + 6)
#define                                 U3PERIE_bit         _BIT_ACCESS(U3ERRIE,6)
// U3ERRIR<U3PERIF>
extern volatile __bit                   U3PERIF             __at(0x16C6);	// @ (0x2D8 * 8 + 6)
#define                                 U3PERIF_bit         _BIT_ACCESS(U3ERRIR,6)
// U3FIFO<U3RCIDL>
extern volatile __bit                   U3RCIDL             __at(0x16B3);	// @ (0x2D6 * 8 + 3)
#define                                 U3RCIDL_bit         _BIT_ACCESS(U3FIFO,3)
// U3CON2<U3RUNOVF>
extern volatile __bit                   U3RUNOVF            __at(0x169F);	// @ (0x2D3 * 8 + 7)
#define                                 U3RUNOVF_bit        _BIT_ACCESS(U3CON2,7)
// U3FIFO<U3RXBE>
extern volatile __bit                   U3RXBE              __at(0x16B1);	// @ (0x2D6 * 8 + 1)
#define                                 U3RXBE_bit          _BIT_ACCESS(U3FIFO,1)
// U3FIFO<U3RXBF>
extern volatile __bit                   U3RXBF              __at(0x16B0);	// @ (0x2D6 * 8 + 0)
#define                                 U3RXBF_bit          _BIT_ACCESS(U3FIFO,0)
// U3CON1<U3RXBIMD>
extern volatile __bit                   U3RXBIMD            __at(0x1693);	// @ (0x2D2 * 8 + 3)
#define                                 U3RXBIMD_bit        _BIT_ACCESS(U3CON1,3)
// U3ERRIE<U3RXBKIE>
extern volatile __bit                   U3RXBKIE            __at(0x16CA);	// @ (0x2D9 * 8 + 2)
#define                                 U3RXBKIE_bit        _BIT_ACCESS(U3ERRIE,2)
// U3ERRIR<U3RXBKIF>
extern volatile __bit                   U3RXBKIF            __at(0x16C2);	// @ (0x2D8 * 8 + 2)
#define                                 U3RXBKIF_bit        _BIT_ACCESS(U3ERRIR,2)
// U3CON0<U3RXEN>
extern volatile __bit                   U3RXEN              __at(0x168C);	// @ (0x2D1 * 8 + 4)
#define                                 U3RXEN_bit          _BIT_ACCESS(U3CON0,4)
// U3ERRIE<U3RXFOIE>
extern volatile __bit                   U3RXFOIE            __at(0x16C9);	// @ (0x2D9 * 8 + 1)
#define                                 U3RXFOIE_bit        _BIT_ACCESS(U3ERRIE,1)
// U3ERRIR<U3RXFOIF>
extern volatile __bit                   U3RXFOIF            __at(0x16C1);	// @ (0x2D8 * 8 + 1)
#define                                 U3RXFOIF_bit        _BIT_ACCESS(U3ERRIR,1)
// U3FIFO<U3RXIDL>
extern volatile __bit                   U3RXIDL             __at(0x16B3);	// @ (0x2D6 * 8 + 3)
#define                                 U3RXIDL_bit         _BIT_ACCESS(U3FIFO,3)
// PIE9<U3RXIE>
extern volatile __bit                   U3RXIE              __at(0x2538);	// @ (0x4A7 * 8 + 0)
#define                                 U3RXIE_bit          _BIT_ACCESS(PIE9,0)
// PIR9<U3RXIF>
extern volatile __bit                   U3RXIF              __at(0x25B8);	// @ (0x4B7 * 8 + 0)
#define                                 U3RXIF_bit          _BIT_ACCESS(PIR9,0)
// IPR9<U3RXIP>
extern volatile __bit                   U3RXIP              __at(0x1B58);	// @ (0x36B * 8 + 0)
#define                                 U3RXIP_bit          _BIT_ACCESS(IPR9,0)
// U3CON2<U3RXPOL>
extern volatile __bit                   U3RXPOL             __at(0x169E);	// @ (0x2D3 * 8 + 6)
#define                                 U3RXPOL_bit         _BIT_ACCESS(U3CON2,6)
// U3RXPPS<U3RXPPS0>
extern volatile __bit                   U3RXPPS0            __at(0x13B0);	// @ (0x276 * 8 + 0)
#define                                 U3RXPPS0_bit        _BIT_ACCESS(U3RXPPS,0)
// U3RXPPS<U3RXPPS1>
extern volatile __bit                   U3RXPPS1            __at(0x13B1);	// @ (0x276 * 8 + 1)
#define                                 U3RXPPS1_bit        _BIT_ACCESS(U3RXPPS,1)
// U3RXPPS<U3RXPPS2>
extern volatile __bit                   U3RXPPS2            __at(0x13B2);	// @ (0x276 * 8 + 2)
#define                                 U3RXPPS2_bit        _BIT_ACCESS(U3RXPPS,2)
// U3RXPPS<U3RXPPS3>
extern volatile __bit                   U3RXPPS3            __at(0x13B3);	// @ (0x276 * 8 + 3)
#define                                 U3RXPPS3_bit        _BIT_ACCESS(U3RXPPS,3)
// U3RXPPS<U3RXPPS4>
extern volatile __bit                   U3RXPPS4            __at(0x13B4);	// @ (0x276 * 8 + 4)
#define                                 U3RXPPS4_bit        _BIT_ACCESS(U3RXPPS,4)
// U3RXPPS<U3RXPPS5>
extern volatile __bit                   U3RXPPS5            __at(0x13B5);	// @ (0x276 * 8 + 5)
#define                                 U3RXPPS5_bit        _BIT_ACCESS(U3RXPPS,5)
// U3CON1<U3SENDB>
extern volatile __bit                   U3SENDB             __at(0x1690);	// @ (0x2D2 * 8 + 0)
#define                                 U3SENDB_bit         _BIT_ACCESS(U3CON1,0)
// U3CON2<U3STP0>
extern volatile __bit                   U3STP0              __at(0x169C);	// @ (0x2D3 * 8 + 4)
#define                                 U3STP0_bit          _BIT_ACCESS(U3CON2,4)
// U3CON2<U3STP1>
extern volatile __bit                   U3STP1              __at(0x169D);	// @ (0x2D3 * 8 + 5)
#define                                 U3STP1_bit          _BIT_ACCESS(U3CON2,5)
// U3FIFO<U3STPMD>
extern volatile __bit                   U3STPMD             __at(0x16B6);	// @ (0x2D6 * 8 + 6)
#define                                 U3STPMD_bit         _BIT_ACCESS(U3FIFO,6)
// U3FIFO<U3TXBE>
extern volatile __bit                   U3TXBE              __at(0x16B5);	// @ (0x2D6 * 8 + 5)
#define                                 U3TXBE_bit          _BIT_ACCESS(U3FIFO,5)
// U3FIFO<U3TXBF>
extern volatile __bit                   U3TXBF              __at(0x16B4);	// @ (0x2D6 * 8 + 4)
#define                                 U3TXBF_bit          _BIT_ACCESS(U3FIFO,4)
// U3ERRIE<U3TXCIE>
extern volatile __bit                   U3TXCIE             __at(0x16C8);	// @ (0x2D9 * 8 + 0)
#define                                 U3TXCIE_bit         _BIT_ACCESS(U3ERRIE,0)
// U3ERRIR<U3TXCIF>
extern volatile __bit                   U3TXCIF             __at(0x16C0);	// @ (0x2D8 * 8 + 0)
#define                                 U3TXCIF_bit         _BIT_ACCESS(U3ERRIR,0)
// U3CON0<U3TXEN>
extern volatile __bit                   U3TXEN              __at(0x168D);	// @ (0x2D1 * 8 + 5)
#define                                 U3TXEN_bit          _BIT_ACCESS(U3CON0,5)
// PIE9<U3TXIE>
extern volatile __bit                   U3TXIE              __at(0x2539);	// @ (0x4A7 * 8 + 1)
#define                                 U3TXIE_bit          _BIT_ACCESS(PIE9,1)
// PIR9<U3TXIF>
extern volatile __bit                   U3TXIF              __at(0x25B9);	// @ (0x4B7 * 8 + 1)
#define                                 U3TXIF_bit          _BIT_ACCESS(PIR9,1)
// IPR9<U3TXIP>
extern volatile __bit                   U3TXIP              __at(0x1B59);	// @ (0x36B * 8 + 1)
#define                                 U3TXIP_bit          _BIT_ACCESS(IPR9,1)
// U3ERRIE<U3TXMTIE>
extern volatile __bit                   U3TXMTIE            __at(0x16CF);	// @ (0x2D9 * 8 + 7)
#define                                 U3TXMTIE_bit        _BIT_ACCESS(U3ERRIE,7)
// U3ERRIR<U3TXMTIF>
extern volatile __bit                   U3TXMTIF            __at(0x16C7);	// @ (0x2D8 * 8 + 7)
#define                                 U3TXMTIF_bit        _BIT_ACCESS(U3ERRIR,7)
// U3CON2<U3TXPOL>
extern volatile __bit                   U3TXPOL             __at(0x169A);	// @ (0x2D3 * 8 + 2)
#define                                 U3TXPOL_bit         _BIT_ACCESS(U3CON2,2)
// U3FIFO<U3TXWRE>
extern volatile __bit                   U3TXWRE             __at(0x16B7);	// @ (0x2D6 * 8 + 7)
#define                                 U3TXWRE_bit         _BIT_ACCESS(U3FIFO,7)
// U3CON1<U3WUE>
extern volatile __bit                   U3WUE               __at(0x1694);	// @ (0x2D2 * 8 + 4)
#define                                 U3WUE_bit           _BIT_ACCESS(U3CON1,4)
// U3UIR<U3WUIF>
extern volatile __bit                   U3WUIF              __at(0x16BF);	// @ (0x2D7 * 8 + 7)
#define                                 U3WUIF_bit          _BIT_ACCESS(U3UIR,7)
// U3FIFO<U3XON>
extern volatile __bit                   U3XON               __at(0x16B2);	// @ (0x2D6 * 8 + 2)
#define                                 U3XON_bit           _BIT_ACCESS(U3FIFO,2)
// U4CON0<U4ABDEN>
extern volatile __bit                   U4ABDEN             __at(0x1726);	// @ (0x2E4 * 8 + 6)
#define                                 U4ABDEN_bit         _BIT_ACCESS(U4CON0,6)
// U4UIR<U4ABDIE>
extern volatile __bit                   U4ABDIE             __at(0x1752);	// @ (0x2EA * 8 + 2)
#define                                 U4ABDIE_bit         _BIT_ACCESS(U4UIR,2)
// U4UIR<U4ABDIF>
extern volatile __bit                   U4ABDIF             __at(0x1756);	// @ (0x2EA * 8 + 6)
#define                                 U4ABDIF_bit         _BIT_ACCESS(U4UIR,6)
// U4ERRIE<U4ABDOVE>
extern volatile __bit                   U4ABDOVE            __at(0x1765);	// @ (0x2EC * 8 + 5)
#define                                 U4ABDOVE_bit        _BIT_ACCESS(U4ERRIE,5)
// U4ERRIR<U4ABDOVF>
extern volatile __bit                   U4ABDOVF            __at(0x175D);	// @ (0x2EB * 8 + 5)
#define                                 U4ABDOVF_bit        _BIT_ACCESS(U4ERRIR,5)
// U4CON0<U4BRGS>
extern volatile __bit                   U4BRGS              __at(0x1727);	// @ (0x2E4 * 8 + 7)
#define                                 U4BRGS_bit          _BIT_ACCESS(U4CON0,7)
// U4CON1<U4BRKOVR>
extern volatile __bit                   U4BRKOVR            __at(0x1729);	// @ (0x2E5 * 8 + 1)
#define                                 U4BRKOVR_bit        _BIT_ACCESS(U4CON1,1)
// U4ERRIE<U4CERIE>
extern volatile __bit                   U4CERIE             __at(0x1764);	// @ (0x2EC * 8 + 4)
#define                                 U4CERIE_bit         _BIT_ACCESS(U4ERRIE,4)
// U4ERRIR<U4CERIF>
extern volatile __bit                   U4CERIF             __at(0x175C);	// @ (0x2EB * 8 + 4)
#define                                 U4CERIF_bit         _BIT_ACCESS(U4ERRIR,4)
// U4CTSPPS<U4CTSPPS0>
extern volatile __bit                   U4CTSPPS0           __at(0x13C8);	// @ (0x279 * 8 + 0)
#define                                 U4CTSPPS0_bit       _BIT_ACCESS(U4CTSPPS,0)
// U4CTSPPS<U4CTSPPS1>
extern volatile __bit                   U4CTSPPS1           __at(0x13C9);	// @ (0x279 * 8 + 1)
#define                                 U4CTSPPS1_bit       _BIT_ACCESS(U4CTSPPS,1)
// U4CTSPPS<U4CTSPPS2>
extern volatile __bit                   U4CTSPPS2           __at(0x13CA);	// @ (0x279 * 8 + 2)
#define                                 U4CTSPPS2_bit       _BIT_ACCESS(U4CTSPPS,2)
// U4CTSPPS<U4CTSPPS3>
extern volatile __bit                   U4CTSPPS3           __at(0x13CB);	// @ (0x279 * 8 + 3)
#define                                 U4CTSPPS3_bit       _BIT_ACCESS(U4CTSPPS,3)
// U4CTSPPS<U4CTSPPS4>
extern volatile __bit                   U4CTSPPS4           __at(0x13CC);	// @ (0x279 * 8 + 4)
#define                                 U4CTSPPS4_bit       _BIT_ACCESS(U4CTSPPS,4)
// PIE12<U4EIE>
extern volatile __bit                   U4EIE               __at(0x2552);	// @ (0x4AA * 8 + 2)
#define                                 U4EIE_bit           _BIT_ACCESS(PIE12,2)
// PIR12<U4EIF>
extern volatile __bit                   U4EIF               __at(0x25D2);	// @ (0x4BA * 8 + 2)
#define                                 U4EIF_bit           _BIT_ACCESS(PIR12,2)
// IPR12<U4EIP>
extern volatile __bit                   U4EIP               __at(0x1B72);	// @ (0x36E * 8 + 2)
#define                                 U4EIP_bit           _BIT_ACCESS(IPR12,2)
// U4ERRIE<U4FERIE>
extern volatile __bit                   U4FERIE             __at(0x1763);	// @ (0x2EC * 8 + 3)
#define                                 U4FERIE_bit         _BIT_ACCESS(U4ERRIE,3)
// U4ERRIR<U4FERIF>
extern volatile __bit                   U4FERIF             __at(0x175B);	// @ (0x2EB * 8 + 3)
#define                                 U4FERIF_bit         _BIT_ACCESS(U4ERRIR,3)
// U4CON2<U4FLO0>
extern volatile __bit                   U4FLO0              __at(0x1730);	// @ (0x2E6 * 8 + 0)
#define                                 U4FLO0_bit          _BIT_ACCESS(U4CON2,0)
// U4CON2<U4FLO1>
extern volatile __bit                   U4FLO1              __at(0x1731);	// @ (0x2E6 * 8 + 1)
#define                                 U4FLO1_bit          _BIT_ACCESS(U4CON2,1)
// PIE12<U4IE>
extern volatile __bit                   U4IE                __at(0x2553);	// @ (0x4AA * 8 + 3)
#define                                 U4IE_bit            _BIT_ACCESS(PIE12,3)
// PIR12<U4IF>
extern volatile __bit                   U4IF                __at(0x25D3);	// @ (0x4BA * 8 + 3)
#define                                 U4IF_bit            _BIT_ACCESS(PIR12,3)
// IPR12<U4IP>
extern volatile __bit                   U4IP                __at(0x1B73);	// @ (0x36E * 8 + 3)
#define                                 U4IP_bit            _BIT_ACCESS(IPR12,3)
// PMD6<U4MD>
extern volatile __bit                   U4MD                __at(0x336);	// @ (0x66 * 8 + 6)
#define                                 U4MD_bit            _BIT_ACCESS(PMD6,6)
// U4CON0<U4MODE0>
extern volatile __bit                   U4MODE0             __at(0x1720);	// @ (0x2E4 * 8 + 0)
#define                                 U4MODE0_bit         _BIT_ACCESS(U4CON0,0)
// U4CON0<U4MODE1>
extern volatile __bit                   U4MODE1             __at(0x1721);	// @ (0x2E4 * 8 + 1)
#define                                 U4MODE1_bit         _BIT_ACCESS(U4CON0,1)
